import json
import os
import uvicorn
from language_graph import csvTojson, op_graph_file
from fastapi import FastAPI
from fastapi.middleware.cors import CORSMiddleware
from fastapi import Body
import pydantic
from pydantic import BaseModel
import difflib
from openai import OpenAI

area = "四川省"
client = OpenAI(
    # 这里换成你的密钥
    api_key="fk224204-Bus04HQsNd8XvVoX5z4MYylfPBEz35XC",
    # 这里将官方的接口访问地址，替换成api2d的入口地址
    base_url="https://openai.api2d.net/v1"
)

class BaseResponse(BaseModel):
    status: int = pydantic.Field(0, description="HTTP status code")
    msg: str = pydantic.Field("success", description="HTTP status message")

    class Config:
        orm_mode = True
        schema_extra = {
            "example": {
                "code": 0,
                "msg": "success",
            }
        }


class ChatMessage(BaseResponse):
    data: str = pydantic.Field(..., description="Map config")

    class Config:
        orm_mode = True
        schema_extra = {
            "example": {
                "status": 0,
                "msg": "success",
                "data": {}
            }
        }


class MapMessage(BaseResponse):
    data: dict = pydantic.Field(..., description="Map config")

    class Config:
        schema_extra = {
            "example": {
                "status": 0,
                "msg": "success",
                "data": {}
            }
        }


class ResponseMessage(BaseResponse):
    data: dict = pydantic.Field(..., description="Map config")

    class Config:
        schema_extra = {
            "example": {
                "status": 0,
                # "msg": "success",
                "data": {}
            }
        }


def get_completion(prompt, stream=False, model="gpt-3.5-turbo-1106", max_tokens=1000):
    messages = [{"role": "user", "content": prompt}]
    response = client.chat.completions.create(
        messages=messages,
        model=model,
        max_tokens=max_tokens,
        stream=stream
    )
    if stream:
        return response
    else:
        return response.choices[0].message.content


async def map_data(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                   history=Body([],
                                description="历史对话",
                                examples=[[
                                    {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                    {"role": "assistant", "content": "虎头虎脑"}]]
                                ),
                   stream: bool = Body(False, description="流式输出"),
                   ):
    global area
    question = ["根据最新的人口普查，中国的人口数量有多少",
                "中国的庞大人口数量对其社会和经济发展有哪些影响",
                "中国近几十年的人口数量变化趋势是怎样的",
                "针对中国不断增长的人口数量，你能提出一些可持续的人口管理策略吗",
                "未来几年内，你认为中国的人口数量会如何变化，你能预测并描述可能的人口趋势吗",
                "四川省在近年来发生了哪些重大的地震",
                "四川省曾经发生过哪些重大的山体滑坡事件",
                "这些事件造成了什么样的影响，包括对人们的生活、环境和基础设施造成的影响",
                "针对四川省地质灾害，特别是山体滑坡和地震，你能提出一些有效的预防和减轻灾害影响的策略和应对方案吗",
                "未来五年内，四川省可能面临哪些潜在的地质灾害风险，特别是山体滑坡，你能预测这些风险的发生概率和可能的影响吗",
                ]
    # 字符串相似度匹配
    match = difflib.get_close_matches(query, question, n=1, cutoff=0.8)
    if not match:
        config_map = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_map))
    match = match[0]

    # 第一个问题
    # 第二个问题
    if match == question[0] or match == question[1]:
        year = '2021年'  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        data = [['地区', "2020"],
                ['台湾省', "23561236"],
                ['香港特别行政区', "7474200"],
                ['澳门特别行政区', "683218"],
                ['北京市', "21893095"],
                ['天津市', "13866009"],
                ['河北省', "74610235"],
                ['山西省', "34915616"],
                ['内蒙古自治区', "24049155"],
                ['辽宁省', "42591407"],
                ['吉林省', "24073453"],
                ['黑龙江省', "31850088"],
                ['上海市', "24870895"],
                ['江苏省', "84748016"],
                ['浙江省', "64567588"],
                ['安徽省', "61027171"],
                ['福建省', "41540086"],
                ['江西省', "45188635"],
                ['山东省', "101527453"],
                ['河南省', "99365519"],
                ['湖北省', "57752557"],
                ['湖南省', "66444864"],
                ['广东省', "126012510"],
                ['广西壮族自治区', "50126804"],
                ['海南省', "10081232"],
                ['重庆市', "32054159"],
                ['四川省', "83674866"],
                ['贵州省', "38562148"],
                ['云南省', "47209277"],
                ['西藏自治区', "3648100"],
                ['陕西省', "39528999"],
                ['甘肃省', "25019831"],
                ['青海省', "5923957"],
                ['宁夏回族自治区', "7202654"],
                ['新疆维吾尔自治区', "25852345"]
                ]
        config_map = {"title": {"text": year + area + topic},
                      "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                      "toolbox": {
                          "show": 1,
                          "orient": "vertical",
                          "left": "right",
                          "top": "center",
                          "feature": {
                              "restore": {},
                              "saveAsImage": {}
                          }
                      },
                      "dataset": [{"source": data, "sourceHeader": 1}],
                      "visualMap": {"type": "continuous", "min": 500000, "max": 120000000, "text": ["High", "Low"],
                                    # 改
                                    "realtime": 0, "calculable": 1,
                                    "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                      "series": [{"type": "map", "name": year + area + topic, "map": "CHN", "roam": "scale",
                                  "datasetIndex": 0, "label": {"show": 1}}]}
        print(config_map)
        return ChatMessage(data=str(config_map))
    # 第三个问题
    # 第四个问题
    elif match == question[2] or match == question[3]:
        year = ["1964", "1982", "1990", "2000", "2010", "2020"]  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        mapdata_1964 = [['地区', "1964"],
                        ['台湾省', "12041544"],
                        ['香港特别行政区', "3504600"],
                        ['澳门特别行政区', "201400"],
                        ['北京市', "7568495"],
                        ['天津市', "45687781"],
                        ['河北省', "45687781"],
                        ['山西省', "18015067"],
                        ['内蒙古自治区', "12348638"],
                        ['辽宁省', "26946200"],
                        ['吉林省', "15668663"],
                        ['黑龙江省', "20118271"],
                        ['上海市', "10816458"],
                        ['江苏省', "44504608"],
                        ['浙江省', "28318573"],
                        ['安徽省', "31241657"],
                        ['福建省', "16757223"],
                        ['江西省', "21068019"],
                        ['山东省', "55519038"],
                        ['河南省', "50325511"],
                        ['湖北省', "33709344"],
                        ['湖南省', "37182286"],
                        ['广东省', "42800849"],
                        ['广西壮族自治区', "20845017"],
                        ['海南省', "6557482"],
                        ['重庆市', "30900000"],
                        ['四川省', "67956490"],
                        ['贵州省', "17140521"],
                        ['云南省', "20509525"],
                        ['西藏自治区', "1251225"],
                        ['陕西省', "20766915"],
                        ['甘肃省', "12630569"],
                        ['青海省', "2145604"],
                        ['宁夏回族自治区', "2107490"],
                        ['新疆维吾尔自治区', "7270067"],
                        ]
        mapdata_1982 = [
            ['地区', "1982"],
            ['台湾省', "18270749"],
            ['香港特别行政区', "5264500"],
            ['澳门特别行政区', "256700"],
            ['北京市', "9230687"],
            ['天津市', "7764141"],
            ['河北省', "53005876"],
            ['山西省', "25291389"],
            ['内蒙古自治区', "19274279"],
            ['辽宁省', "35721693"],
            ['吉林省', "22560053"],
            ['黑龙江省', "32665546"],
            ['上海市', "11859748"],
            ['江苏省', "60521114"],
            ['浙江省', "38884603"],
            ['安徽省', "49665724"],
            ['福建省', "25931106"],
            ['江西省', "33184827"],
            ['山东省', "74419054"],
            ['河南省', "74422739"],
            ['湖北省', "47804150"],
            ['湖南省', "54008851"],
            ['广东省', "59299220"],
            ['广西壮族自治区', "36420960"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "99713310"],
            ['贵州省', "28552997"],
            ['云南省', "32553817"],
            ['西藏自治区', "1892393"],
            ['陕西省', "28904423"],
            ['甘肃省', "19569261"],
            ['青海省', "3895706"],
            ['宁夏回族自治区', "3895578"],
            ['新疆维吾尔自治区', "13081681"]
        ]
        mapdata_1990 = [
            ['地区', "1990"],
            ['台湾省', "20155830"],
            ['香港特别行政区', "5704500"],
            ['澳门特别行政区', "350200"],
            ['北京市', "10819407"],
            ['天津市', "8785402"],
            ['河北省', "61082439"],
            ['山西省', "28759014"],
            ['内蒙古自治区', "21456798"],
            ['辽宁省', "39459697"],
            ['吉林省', "24658721"],
            ['黑龙江省', "35214873"],
            ['上海市', "13341896"],
            ['江苏省', "67056519"],
            ['浙江省', "41445930"],
            ['安徽省', "56180813"],
            ['福建省', "30097274"],
            ['江西省', "37710281"],
            ['山东省', "84392827"],
            ['河南省', "85509535"],
            ['湖北省', "53969210"],
            ['湖南省', "60659754"],
            ['广东省', "62829236"],
            ['广西壮族自治区', "42245765"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "107218173"],
            ['贵州省', "32391066"],
            ['云南省', "36972610"],
            ['西藏自治区', "2196010"],
            ['陕西省', "32882403"],
            ['甘肃省', "22371141"],
            ['青海省', "4456946"],
            ['宁夏回族自治区', "4655451"],
            ['新疆维吾尔自治区', "15155778"],
        ]
        mapdata_2000 = [
            ['地区', "2000"],
            ['台湾省', "22280000"],
            ['香港特别行政区', "6780000"],
            ['澳门特别行政区', "440000"],
            ['北京市', "13820000"],
            ['天津市', "10010000"],
            ['河北省', "67440000"],
            ['山西省', "32970000"],
            ['内蒙古自治区', "23760000"],
            ['辽宁省', "42380000"],
            ['吉林省', "27280000"],
            ['黑龙江省', "36890000"],
            ['上海市', "16740000"],
            ['江苏省', "74380000"],
            ['浙江省', "46770000"],
            ['安徽省', "59860000"],
            ['福建省', "34710000"],
            ['江西省', "41400000"],
            ['山东省', "90790000"],
            ['河南省', "92560000"],
            ['湖北省', "60280000"],
            ['湖南省', "64400000"],
            ['广东省', "86420000"],
            ['广西壮族自治区', "44890000"],
            ['海南省', "7870000"],
            ['重庆市', "30900000"],
            ['四川省', "83290000"],
            ['贵州省', "35250000"],
            ['云南省', "42880000"],
            ['西藏自治区', "2620000"],
            ['陕西省', "36050000"],
            ['甘肃省', "25620000"],
            ['青海省', "5180000"],
            ['宁夏回族自治区', "5620000"],
            ['新疆维吾尔自治区', "19250000"],
        ]
        mapdata_2010 = [
            ['地区', "2010"],
            ['台湾省', "23162123"],
            ['香港特别行政区', "7097600"],
            ['澳门特别行政区', "552300"],
            ['北京市', "61780000"],
            ['天津市', "22620000"],
            ['河北省', "52430000"],
            ['山西省', "31140000"],
            ['内蒙古自治区', "25220000"],
            ['辽宁省', "52340000"],
            ['吉林省', "27160000"],
            ['黑龙江省', "34740000"],
            ['上海市', "50530000"],
            ['江苏省', "85070000"],
            ['浙江省', "50780000"],
            ['安徽省', "39850000"],
            ['福建省', "30850000"],
            ['江西省', "30520000"],
            ['山东省', "83290000"],
            ['河南省', "60160000"],
            ['湖北省', "54560000"],
            ['湖南省', "49890000"],
            ['广东省', "85670000"],
            ['广西壮族自治区', "27510000"],
            ['海南省', "6740000"],
            ['重庆市', "24930000"],
            ['四川省', "53680000"],
            ['贵州省', "18390000"],
            ['云南省', "26560000"],
            ['西藏自治区', "1650000"],
            ['陕西省', "39400000"],
            ['甘肃省', "19230000"],
            ['青海省', "4850000"],
            ['宁夏回族自治区', "5770000"],
            ['新疆维吾尔自治区', "23200000"],
        ]
        mapdata_2020 = [
            ['地区', "2020"],
            ['台湾省', "23561236"],
            ['香港特别行政区', "7474200"],
            ['澳门特别行政区', "683218"],
            ['北京市', "21893095"],
            ['天津市', "13866009"],
            ['河北省', "74610235"],
            ['山西省', "34915616"],
            ['内蒙古自治区', "24049155"],
            ['辽宁省', "42591407"],
            ['吉林省', "24073453"],
            ['黑龙江省', "31850088"],
            ['上海市', "24870895"],
            ['江苏省', "84748016"],
            ['浙江省', "64567588"],
            ['安徽省', "61027171"],
            ['福建省', "41540086"],
            ['江西省', "45188635"],
            ['山东省', "101527453"],
            ['河南省', "99365519"],
            ['湖北省', "57752557"],
            ['湖南省', "66444864"],
            ['广东省', "126012510"],
            ['广西壮族自治区', "50126804"],
            ['海南省', "10081232"],
            ['重庆市', "32054159"],
            ['四川省', "83674866"],
            ['贵州省', "38562148"],
            ['云南省', "47209277"],
            ['西藏自治区', "3648100"],
            ['陕西省', "39528999"],
            ['甘肃省', "25019831"],
            ['青海省', "5923957"],
            ['宁夏回族自治区', "7202654"],
            ['新疆维吾尔自治区', "25852345"]
        ]
        config_map = {
            "baseOption": {
                "title": {"text": "近几十年来" + area + topic + "变化"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_1964, "sourceHeader": 1},
                    {"source": mapdata_1982, "sourceHeader": 1},
                    {"source": mapdata_1990, "sourceHeader": 1},
                    {"source": mapdata_2000, "sourceHeader": 1},
                    {"source": mapdata_2010, "sourceHeader": 1},
                    {"source": mapdata_2020, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": 500000, "max": 120000000, "text": ["High", "Low"],  # 改
                              "realtime": 0, "calculable": 1,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "3", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "4", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "5", "label": {"show": 0}}]
                }
            ]}
        return ChatMessage(data=str(config_map))
    # 第五个问题
    elif match == question[4]:
        year = ["2025", "2030", "2035", "2040"]  # 年份
        topic = '人口数量'  # 主题
        unit = "万人"  # 单位
        area = "中国"  # 地区
        # 地理底图的数据
        mapdata_2025 = [
            ['地区', "2025"],
            ['安徽省', "6102.7"],
            ['北京市', "2189.3"],
            ['福建省', "4154.0"],
            ['甘肃省', "2502.0"],
            ['广东省', "12601.3"],
            ['广西壮族自治区', "5012.7"],
            ['贵州省', "3856.2"],
            ['海南省', "1008.1"],
            ['河北省', "7461.0"],
            ['河南省', "9936.6"],
            ['黑龙江省', "3185.0"],
            ['湖北省', "5775.3"],
            ['湖南省', "6644.5"],
            ['吉林省', "2407.3"],
            ['江苏省', "8474.8"],
            ['江西省', "4518.9"],
            ['辽宁省', "4259.1"],
            ['内蒙古自治区', "2404.9"],
            ['宁夏回族自治区', "720.3"],
            ['青海省', "592.4"],
            ['山东省', "10152.7"],
            ['山西省', "3491.6"],
            ['陕西省', "3952.9"],
            ['上海市', "2487.1"],
            ['四川省', "8367.5"],
            ['天津市', "1386.6"],
            ['西藏自治区', "364.8"],
            ['新疆维吾尔自治区', "2585.2"],
            ['云南省', "4720.9"],
            ['浙江省', "6456.8"],
            ['重庆市', "3205.4"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        mapdata_2030 = [
            ['地区', "2030"],
            ['安徽省', "6140.8"],
            ['北京市', "2179.9"],
            ['福建省', "4278.3"],
            ['甘肃省', "2460"],
            ['广东省', "13015.5"],
            ['广西壮族自治区', "5147"],
            ['贵州省', "3963.7"],
            ['海南省', "1049.2"],
            ['河北省', "7494.5"],
            ['河南省', "9989.9"],
            ['黑龙江省', "3094.6"],
            ['湖北省', "5800.6"],
            ['湖南省', "6622.6"],
            ['吉林省', "2344.4"],
            ['江苏省', "8492.7"],
            ['江西省', "4512.4"],
            ['辽宁省', "4109.8"],
            ['内蒙古自治区', "2351.5"],
            ['宁夏回族自治区', "738"],
            ['青海省', "594.5"],
            ['山东省', "10267"],
            ['山西省', "3453.1"],
            ['陕西省', "3987.9"],
            ['上海市', "2507.5"],
            ['四川省', "8368.6"],
            ['天津市', "1402.3"],
            ['西藏自治区', "387.9"],
            ['新疆维吾尔自治区', "2722.5"],
            ['云南省', "4683.4"],
            ['浙江省', "6761.3"],
            ['重庆市', "3286.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        mapdata_2035 = [
            ['地区', "2035"],
            ['安徽省', "6065.0"],
            ['北京市', "2120.8"],
            ['福建省', "4357.9"],
            ['甘肃省', "2348.6"],
            ['广东省', "13310.8"],
            ['广西壮族自治区', "5228.0"],
            ['贵州省', "4019.0"],
            ['海南省', "1083.9"],
            ['河北省', "7390.4"],
            ['河南省', "9851.8"],
            ['黑龙江省', "2916.7"],
            ['湖北省', "5598.1"],
            ['湖南省', "6464.1"],
            ['吉林省', "2214.4"],
            ['江苏省', "8336.0"],
            ['江西省', "4410.0"],
            ['辽宁省', "3824.6"],
            ['内蒙古自治区', "2226.2"],
            ['宁夏回族自治区', "746.1"],
            ['青海省', "584.0"],
            ['山东省', "10197.3"],
            ['山西省', "3328.0"],
            ['陕西省', "3951.5"],
            ['上海市', "2482.5"],
            ['四川省', "8186.5"],
            ['天津市', "1396.2"],
            ['西藏自治区', "411.7"],
            ['新疆维吾尔自治区', "2858.4"],
            ['云南省', "4529.2"],
            ['浙江省', "7073.4"],
            ['重庆市', "3328.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        mapdata_2040 = [
            ['地区', "2040"],
            ['安徽省', "5977.5"],
            ['北京市', "2064.4"],
            ['福建省', "4401.3"],
            ['甘肃省', "2249.6"],
            ['广东省', "13485.1"],
            ['广西壮族自治区', "5268.6"],
            ['贵州省', "4044.8"],
            ['海南省', "1106.5"],
            ['河北省', "7274.4"],
            ['河南省', "9697.6"],
            ['黑龙江省', "2762.3"],
            ['湖北省', "5412"],
            ['湖南省', "6309"],
            ['吉林省', "2101.2"],
            ['江苏省', "8174"],
            ['江西省', "4308.7"],
            ['辽宁省', "3580.8"],
            ['内蒙古自治区', "2116.6"],
            ['宁夏回族自治区', "749.2"],
            ['青海省', "573"],
            ['山东省', "10095.9"],
            ['山西省', "3213.7"],
            ['陕西省', "3904.7"],
            ['上海市', "2451.4"],
            ['四川省', "8005"],
            ['天津市', "1385"],
            ['西藏自治区', "428.7"],
            ['新疆维吾尔自治区', "2953.3"],
            ['云南省', "4386.4"],
            ['浙江省', "7289.2"],
            ['重庆市', "3346.5"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"]
        ]
        config_map = {
            "baseOption": {
                "title": {"text": "未来十多年" + area + topic + "预测"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2025, "sourceHeader": 1},
                    {"source": mapdata_2030, "sourceHeader": 1},
                    {"source": mapdata_2035, "sourceHeader": 1},
                    {"source": mapdata_2040, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": 50, "max": 10000, "text": ["High", "Low"],
                              "realtime": 0, "calculable": 1,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))
    elif match == question[5] or match == question[7]:
        year = ["2020", "2021", "2022", "2023"]  # 年份
        topic = '地震'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        mapdata_2023 = [
            ['地区', "2023"],
            ['成都市', "1"],
            ['绵阳市', "2"],
            ['自贡市', "1"],
            ['泸州市', "2"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "9"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "5"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "20"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "24"],
            ['凉山彝族自治州', "2"],
        ]
        mapdata_2022 = [
            ['地区', "2022"],
            ['成都市', "1"],
            ['绵阳市', "6"],
            ['自贡市', "0"],
            ['泸州市', "3"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "4"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "15"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "17"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "23"],
            ['甘孜藏族自治州', "22"],
            ['凉山彝族自治州', "2"]
        ]
        mapdata_2021 = [
            ['地区', "2021"],
            ['成都市', "1"],
            ['绵阳市', "8"],
            ['自贡市', "4"],
            ['泸州市', "11"],
            ['德阳市', "0"],
            ['广元市', "3"],
            ['遂宁市', "0"],
            ['内江市', "6"],
            ['乐山市', "5"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "2"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "24"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "12"],
            ['甘孜藏族自治州', "4"],
            ['凉山彝族自治州', "13"]
        ]
        mapdata_2020 = [
            ['地区', "2020"],
            ['成都市', "3"],
            ['绵阳市', "12"],
            ['自贡市', "8"],
            ['泸州市', "1"],
            ['德阳市', "2"],
            ['广元市', "4"],
            ['遂宁市', "0"],
            ['内江市', "5"],
            ['乐山市', "3"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "42"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "7"],
            ['甘孜藏族自治州', "13"],
            ['凉山彝族自治州', "3"]
        ]

        config_map = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2020, "sourceHeader": 1},
                    {"source": mapdata_2021, "sourceHeader": 1},
                    {"source": mapdata_2022, "sourceHeader": 1},
                    {"source": mapdata_2023, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": '0', "max": '24', "text": ["多", "少"],
                              "realtime": 0, "calculable": 0,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": year[0] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[1] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[2] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[3] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))
    elif match == question[6] or match == question[8]:
        year = ["2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        mapdata_2023 = [
            ['地区', "2023"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2022 = [
            ['地区', "2022"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2021 = [
            ['地区', "2021"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "1"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "2"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "1"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2020 = [
            ['地区', "2020"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2019 = [
            ['地区', "2019"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2018 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2017 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        mapdata_2016 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        config_map = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2016, "sourceHeader": 1},
                    {"source": mapdata_2017, "sourceHeader": 1},
                    {"source": mapdata_2018, "sourceHeader": 1},
                    {"source": mapdata_2019, "sourceHeader": 1},
                    {"source": mapdata_2020, "sourceHeader": 1},
                    {"source": mapdata_2021, "sourceHeader": 1},
                    {"source": mapdata_2022, "sourceHeader": 1},
                    {"source": mapdata_2023, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": '0', "max": '3', "text": ["多", "少"],
                              "realtime": 0, "calculable": 0,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": year[0] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[1] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[2] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[3] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[4] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "4", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[5] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "5", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[6] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "6", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[7] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "7", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))
    else:
        year = ["2024", "2025", "2026", "2027", "2028"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 地理底图的数据
        mapdata_2024 = [
            ['地区', "2024"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2025 = [
            ['地区', "2025"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        mapdata_2026 = [
            ['地区', "2026"],
            ['成都市', "0"],
            ['绵阳市', "2"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2027 = [
            ['地区', "2027"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2028 = [
            ['地区', "2028"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        config_map = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "预测"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2024, "sourceHeader": 1},
                    {"source": mapdata_2025, "sourceHeader": 1},
                    {"source": mapdata_2026, "sourceHeader": 1},
                    {"source": mapdata_2027, "sourceHeader": 1},
                    {"source": mapdata_2028, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": '0', "max": '3', "text": ["多", "少"],
                              "realtime": 0, "calculable": 0,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": year[0] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[1] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[2] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[3] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[4] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "4", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))


async def bar_data(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                   history=Body([],
                                description="历史对话",
                                examples=[[
                                    {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                    {"role": "assistant", "content": "虎头虎脑"}]]
                                ),
                   stream: bool = Body(False, description="流式输出"),
                   ):
    global area
    question = ["根据最新的人口普查，中国的人口数量有多少",
                "中国的庞大人口数量对其社会和经济发展有哪些影响",
                "中国近几十年的人口数量变化趋势是怎样的",
                "针对中国不断增长的人口数量，你能提出一些可持续的人口管理策略吗",
                "未来几年内，你认为中国的人口数量会如何变化，你能预测并描述可能的人口趋势吗",
                "四川省在近年来发生了哪些重大的地震",
                "四川省曾经发生过哪些重大的山体滑坡事件",
                "这些事件造成了什么样的影响，包括对人们的生活、环境和基础设施造成的影响",
                "针对四川省地质灾害，特别是山体滑坡和地震，你能提出一些有效的预防和减轻灾害影响的策略和应对方案吗",
                "未来五年内，四川省可能面临哪些潜在的地质灾害风险，特别是山体滑坡，你能预测这些风险的发生概率和可能的影响吗",
                ]
    # 字符串相似度匹配
    match = difflib.get_close_matches(query, question, n=1, cutoff=0.8)
    if not match:
        config_bar = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_bar))
    match = match[0]
    # 第一个问题
    # 第二个问题
    if match == question[0] or match == question[1]:
        year = '2021年'  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        data = [['地区', "2020"],
                ['台湾省', "23561236"],
                ['香港特别行政区', "7474200"],
                ['澳门特别行政区', "683218"],
                ['北京市', "21893095"],
                ['天津市', "13866009"],
                ['河北省', "74610235"],
                ['山西省', "34915616"],
                ['内蒙古自治区', "24049155"],
                ['辽宁省', "42591407"],
                ['吉林省', "24073453"],
                ['黑龙江省', "31850088"],
                ['上海市', "24870895"],
                ['江苏省', "84748016"],
                ['浙江省', "64567588"],
                ['安徽省', "61027171"],
                ['福建省', "41540086"],
                ['江西省', "45188635"],
                ['山东省', "101527453"],
                ['河南省', "99365519"],
                ['湖北省', "57752557"],
                ['湖南省', "66444864"],
                ['广东省', "126012510"],
                ['广西壮族自治区', "50126804"],
                ['海南省', "10081232"],
                ['重庆市', "32054159"],
                ['四川省', "83674866"],
                ['贵州省', "38562148"],
                ['云南省', "47209277"],
                ['西藏自治区', "3648100"],
                ['陕西省', "39528999"],
                ['甘肃省', "25019831"],
                ['青海省', "5923957"],
                ['宁夏回族自治区', "7202654"],
                ['新疆维吾尔自治区', "25852345"]
                ]
        config_bar = {"title": {"text": year + area + topic}, "legend": {"formatter": topic},
                      "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                      "dataset": [{"source": data, "sourceHeader": 1}],
                      "xAxis": {"type": "category", "axisTick": {"show": 0}},
                      "yAxis": {"type": 'value', "name": topic}, "series": [{"type": "bar", "datasetIndex": "0"},
                                                                            {"type": "line", "datasetIndex": "0"}]}
        print(config_bar)
        return ChatMessage(data=str(config_bar))
    # 第三个问题
    # 第四个问题
    elif match == question[2] or match == question[3]:
        year = ["1964", "1982", "1990", "2000", "2010", "2020"]  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        data_1964 = [['地区', "1964"],
                     ['台湾省', "12041544"],
                     ['香港特别行政区', "3504600"],
                     ['澳门特别行政区', "201400"],
                     ['北京市', "7568495"],
                     ['天津市', "45687781"],
                     ['河北省', "45687781"],
                     ['山西省', "18015067"],
                     ['内蒙古自治区', "12348638"],
                     ['辽宁省', "26946200"],
                     ['吉林省', "15668663"],
                     ['黑龙江省', "20118271"],
                     ['上海市', "10816458"],
                     ['江苏省', "44504608"],
                     ['浙江省', "28318573"],
                     ['安徽省', "31241657"],
                     ['福建省', "16757223"],
                     ['江西省', "21068019"],
                     ['山东省', "55519038"],
                     ['河南省', "50325511"],
                     ['湖北省', "33709344"],
                     ['湖南省', "37182286"],
                     ['广东省', "42800849"],
                     ['广西壮族自治区', "20845017"],
                     ['海南省', "6557482"],
                     ['重庆市', "30900000"],
                     ['四川省', "67956490"],
                     ['贵州省', "17140521"],
                     ['云南省', "20509525"],
                     ['西藏自治区', "1251225"],
                     ['陕西省', "20766915"],
                     ['甘肃省', "12630569"],
                     ['青海省', "2145604"],
                     ['宁夏回族自治区', "2107490"],
                     ['新疆维吾尔自治区', "7270067"],
                     ]
        data_1982 = [
            ['地区', "1982"],
            ['台湾省', "18270749"],
            ['香港特别行政区', "5264500"],
            ['澳门特别行政区', "256700"],
            ['北京市', "9230687"],
            ['天津市', "7764141"],
            ['河北省', "53005876"],
            ['山西省', "25291389"],
            ['内蒙古自治区', "19274279"],
            ['辽宁省', "35721693"],
            ['吉林省', "22560053"],
            ['黑龙江省', "32665546"],
            ['上海市', "11859748"],
            ['江苏省', "60521114"],
            ['浙江省', "38884603"],
            ['安徽省', "49665724"],
            ['福建省', "25931106"],
            ['江西省', "33184827"],
            ['山东省', "74419054"],
            ['河南省', "74422739"],
            ['湖北省', "47804150"],
            ['湖南省', "54008851"],
            ['广东省', "59299220"],
            ['广西壮族自治区', "36420960"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "99713310"],
            ['贵州省', "28552997"],
            ['云南省', "32553817"],
            ['西藏自治区', "1892393"],
            ['陕西省', "28904423"],
            ['甘肃省', "19569261"],
            ['青海省', "3895706"],
            ['宁夏回族自治区', "3895578"],
            ['新疆维吾尔自治区', "13081681"]
        ]
        data_1990 = [
            ['地区', "1990"],
            ['台湾省', "20155830"],
            ['香港特别行政区', "5704500"],
            ['澳门特别行政区', "350200"],
            ['北京市', "10819407"],
            ['天津市', "8785402"],
            ['河北省', "61082439"],
            ['山西省', "28759014"],
            ['内蒙古自治区', "21456798"],
            ['辽宁省', "39459697"],
            ['吉林省', "24658721"],
            ['黑龙江省', "35214873"],
            ['上海市', "13341896"],
            ['江苏省', "67056519"],
            ['浙江省', "41445930"],
            ['安徽省', "56180813"],
            ['福建省', "30097274"],
            ['江西省', "37710281"],
            ['山东省', "84392827"],
            ['河南省', "85509535"],
            ['湖北省', "53969210"],
            ['湖南省', "60659754"],
            ['广东省', "62829236"],
            ['广西壮族自治区', "42245765"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "107218173"],
            ['贵州省', "32391066"],
            ['云南省', "36972610"],
            ['西藏自治区', "2196010"],
            ['陕西省', "32882403"],
            ['甘肃省', "22371141"],
            ['青海省', "4456946"],
            ['宁夏回族自治区', "4655451"],
            ['新疆维吾尔自治区', "15155778"],
        ]
        data_2000 = [
            ['地区', "2000"],
            ['台湾省', "22280000"],
            ['香港特别行政区', "6780000"],
            ['澳门特别行政区', "440000"],
            ['北京市', "13820000"],
            ['天津市', "10010000"],
            ['河北省', "67440000"],
            ['山西省', "32970000"],
            ['内蒙古自治区', "23760000"],
            ['辽宁省', "42380000"],
            ['吉林省', "27280000"],
            ['黑龙江省', "36890000"],
            ['上海市', "16740000"],
            ['江苏省', "74380000"],
            ['浙江省', "46770000"],
            ['安徽省', "59860000"],
            ['福建省', "34710000"],
            ['江西省', "41400000"],
            ['山东省', "90790000"],
            ['河南省', "92560000"],
            ['湖北省', "60280000"],
            ['湖南省', "64400000"],
            ['广东省', "86420000"],
            ['广西壮族自治区', "44890000"],
            ['海南省', "7870000"],
            ['重庆市', "30900000"],
            ['四川省', "83290000"],
            ['贵州省', "35250000"],
            ['云南省', "42880000"],
            ['西藏自治区', "2620000"],
            ['陕西省', "36050000"],
            ['甘肃省', "25620000"],
            ['青海省', "5180000"],
            ['宁夏回族自治区', "5620000"],
            ['新疆维吾尔自治区', "19250000"],
        ]
        data_2010 = [
            ['地区', "2010"],
            ['台湾省', "23162123"],
            ['香港特别行政区', "7097600"],
            ['澳门特别行政区', "552300"],
            ['北京市', "61780000"],
            ['天津市', "22620000"],
            ['河北省', "52430000"],
            ['山西省', "31140000"],
            ['内蒙古自治区', "25220000"],
            ['辽宁省', "52340000"],
            ['吉林省', "27160000"],
            ['黑龙江省', "34740000"],
            ['上海市', "50530000"],
            ['江苏省', "85070000"],
            ['浙江省', "50780000"],
            ['安徽省', "39850000"],
            ['福建省', "30850000"],
            ['江西省', "30520000"],
            ['山东省', "83290000"],
            ['河南省', "60160000"],
            ['湖北省', "54560000"],
            ['湖南省', "49890000"],
            ['广东省', "85670000"],
            ['广西壮族自治区', "27510000"],
            ['海南省', "6740000"],
            ['重庆市', "24930000"],
            ['四川省', "53680000"],
            ['贵州省', "18390000"],
            ['云南省', "26560000"],
            ['西藏自治区', "1650000"],
            ['陕西省', "39400000"],
            ['甘肃省', "19230000"],
            ['青海省', "4850000"],
            ['宁夏回族自治区', "5770000"],
            ['新疆维吾尔自治区', "23200000"],
        ]
        data_2020 = [
            ['地区', "2020"],
            ['台湾省', "23561236"],
            ['香港特别行政区', "7474200"],
            ['澳门特别行政区', "683218"],
            ['北京市', "21893095"],
            ['天津市', "13866009"],
            ['河北省', "74610235"],
            ['山西省', "34915616"],
            ['内蒙古自治区', "24049155"],
            ['辽宁省', "42591407"],
            ['吉林省', "24073453"],
            ['黑龙江省', "31850088"],
            ['上海市', "24870895"],
            ['江苏省', "84748016"],
            ['浙江省', "64567588"],
            ['安徽省', "61027171"],
            ['福建省', "41540086"],
            ['江西省', "45188635"],
            ['山东省', "101527453"],
            ['河南省', "99365519"],
            ['湖北省', "57752557"],
            ['湖南省', "66444864"],
            ['广东省', "126012510"],
            ['广西壮族自治区', "50126804"],
            ['海南省', "10081232"],
            ['重庆市', "32054159"],
            ['四川省', "83674866"],
            ['贵州省', "38562148"],
            ['云南省', "47209277"],
            ['西藏自治区', "3648100"],
            ['陕西省', "39528999"],
            ['甘肃省', "25019831"],
            ['青海省', "5923957"],
            ['宁夏回族自治区', "7202654"],
            ['新疆维吾尔自治区', "25852345"]
        ]
        config_bar = {
            "baseOption": {
                "title": {"text": "近几十年来" + area + topic + "变化"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_1964, "sourceHeader": 1},
                    {"source": data_1982, "sourceHeader": 1},
                    {"source": data_1990, "sourceHeader": 1},
                    {"source": data_2000, "sourceHeader": 1},
                    {"source": data_2010, "sourceHeader": 1},
                    {"source": data_2020, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}, {"type": "line", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}, {"type": "line", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}, {"type": "line", "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}, {"type": "line", "datasetIndex": "3"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "4"}, {"type": "line", "datasetIndex": "4"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "5"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))
    # 第五个问题
    elif match == question[4]:
        year = ["2025", "2030", "2035", "2040"]  # 年份
        topic = '人口数量'  # 主题
        unit = "万人"  # 单位
        area = "中国"  # 地区
        # 地理底图的数据
        data_2025 = [
            ['地区', "2025"],
            ['安徽省', "6102.7"],
            ['北京市', "2189.3"],
            ['福建省', "4154.0"],
            ['甘肃省', "2502.0"],
            ['广东省', "12601.3"],
            ['广西壮族自治区', "5012.7"],
            ['贵州省', "3856.2"],
            ['海南省', "1008.1"],
            ['河北省', "7461.0"],
            ['河南省', "9936.6"],
            ['黑龙江省', "3185.0"],
            ['湖北省', "5775.3"],
            ['湖南省', "6644.5"],
            ['吉林省', "2407.3"],
            ['江苏省', "8474.8"],
            ['江西省', "4518.9"],
            ['辽宁省', "4259.1"],
            ['内蒙古自治区', "2404.9"],
            ['宁夏回族自治区', "720.3"],
            ['青海省', "592.4"],
            ['山东省', "10152.7"],
            ['山西省', "3491.6"],
            ['陕西省', "3952.9"],
            ['上海市', "2487.1"],
            ['四川省', "8367.5"],
            ['天津市', "1386.6"],
            ['西藏自治区', "364.8"],
            ['新疆维吾尔自治区', "2585.2"],
            ['云南省', "4720.9"],
            ['浙江省', "6456.8"],
            ['重庆市', "3205.4"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        data_2030 = [
            ['地区', "2030"],
            ['安徽省', "6140.8"],
            ['北京市', "2179.9"],
            ['福建省', "4278.3"],
            ['甘肃省', "2460"],
            ['广东省', "13015.5"],
            ['广西壮族自治区', "5147"],
            ['贵州省', "3963.7"],
            ['海南省', "1049.2"],
            ['河北省', "7494.5"],
            ['河南省', "9989.9"],
            ['黑龙江省', "3094.6"],
            ['湖北省', "5800.6"],
            ['湖南省', "6622.6"],
            ['吉林省', "2344.4"],
            ['江苏省', "8492.7"],
            ['江西省', "4512.4"],
            ['辽宁省', "4109.8"],
            ['内蒙古自治区', "2351.5"],
            ['宁夏回族自治区', "738"],
            ['青海省', "594.5"],
            ['山东省', "10267"],
            ['山西省', "3453.1"],
            ['陕西省', "3987.9"],
            ['上海市', "2507.5"],
            ['四川省', "8368.6"],
            ['天津市', "1402.3"],
            ['西藏自治区', "387.9"],
            ['新疆维吾尔自治区', "2722.5"],
            ['云南省', "4683.4"],
            ['浙江省', "6761.3"],
            ['重庆市', "3286.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        data_2035 = [
            ['地区', "2035"],
            ['安徽省', "6065.0"],
            ['北京市', "2120.8"],
            ['福建省', "4357.9"],
            ['甘肃省', "2348.6"],
            ['广东省', "13310.8"],
            ['广西壮族自治区', "5228.0"],
            ['贵州省', "4019.0"],
            ['海南省', "1083.9"],
            ['河北省', "7390.4"],
            ['河南省', "9851.8"],
            ['黑龙江省', "2916.7"],
            ['湖北省', "5598.1"],
            ['湖南省', "6464.1"],
            ['吉林省', "2214.4"],
            ['江苏省', "8336.0"],
            ['江西省', "4410.0"],
            ['辽宁省', "3824.6"],
            ['内蒙古自治区', "2226.2"],
            ['宁夏回族自治区', "746.1"],
            ['青海省', "584.0"],
            ['山东省', "10197.3"],
            ['山西省', "3328.0"],
            ['陕西省', "3951.5"],
            ['上海市', "2482.5"],
            ['四川省', "8186.5"],
            ['天津市', "1396.2"],
            ['西藏自治区', "411.7"],
            ['新疆维吾尔自治区', "2858.4"],
            ['云南省', "4529.2"],
            ['浙江省', "7073.4"],
            ['重庆市', "3328.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        data_2040 = [
            ['地区', "2040"],
            ['安徽省', "5977.5"],
            ['北京市', "2064.4"],
            ['福建省', "4401.3"],
            ['甘肃省', "2249.6"],
            ['广东省', "13485.1"],
            ['广西壮族自治区', "5268.6"],
            ['贵州省', "4044.8"],
            ['海南省', "1106.5"],
            ['河北省', "7274.4"],
            ['河南省', "9697.6"],
            ['黑龙江省', "2762.3"],
            ['湖北省', "5412"],
            ['湖南省', "6309"],
            ['吉林省', "2101.2"],
            ['江苏省', "8174"],
            ['江西省', "4308.7"],
            ['辽宁省', "3580.8"],
            ['内蒙古自治区', "2116.6"],
            ['宁夏回族自治区', "749.2"],
            ['青海省', "573"],
            ['山东省', "10095.9"],
            ['山西省', "3213.7"],
            ['陕西省', "3904.7"],
            ['上海市', "2451.4"],
            ['四川省', "8005"],
            ['天津市', "1385"],
            ['西藏自治区', "428.7"],
            ['新疆维吾尔自治区', "2953.3"],
            ['云南省', "4386.4"],
            ['浙江省', "7289.2"],
            ['重庆市', "3346.5"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"]
        ]
        config_bar = {
            "baseOption": {
                "title": {"text": "未来十多年" + area + topic + "预测"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2025, "sourceHeader": 1},
                    {"source": data_2030, "sourceHeader": 1},
                    {"source": data_2035, "sourceHeader": 1},
                    {"source": data_2040, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}, {"type": "line", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}, {"type": "line", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}, {"type": "line", "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}, {"type": "line", "datasetIndex": "3"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))

    elif match == question[5] or match == question[7]:
        year = ["2020", "2021", "2022", "2023"]  # 年份
        topic = '地震'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        data_2023 = [
            ['地区', "2023"],
            ['成都市', "1"],
            ['绵阳市', "2"],
            ['自贡市', "1"],
            ['泸州市', "2"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "9"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "5"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "20"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "24"],
            ['凉山彝族自治州', "2"],
        ]
        data_2022 = [
            ['地区', "2022"],
            ['成都市', "1"],
            ['绵阳市', "6"],
            ['自贡市', "0"],
            ['泸州市', "3"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "4"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "15"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "17"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "23"],
            ['甘孜藏族自治州', "22"],
            ['凉山彝族自治州', "2"]
        ]
        data_2021 = [
            ['地区', "2021"],
            ['成都市', "1"],
            ['绵阳市', "8"],
            ['自贡市', "4"],
            ['泸州市', "11"],
            ['德阳市', "0"],
            ['广元市', "3"],
            ['遂宁市', "0"],
            ['内江市', "6"],
            ['乐山市', "5"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "2"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "24"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "12"],
            ['甘孜藏族自治州', "4"],
            ['凉山彝族自治州', "13"]
        ]
        data_2020 = [
            ['地区', "2020"],
            ['成都市', "3"],
            ['绵阳市', "12"],
            ['自贡市', "8"],
            ['泸州市', "1"],
            ['德阳市', "2"],
            ['广元市', "4"],
            ['遂宁市', "0"],
            ['内江市', "5"],
            ['乐山市', "3"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "42"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "7"],
            ['甘孜藏族自治州', "13"],
            ['凉山彝族自治州', "3"]
        ]

        config_bar = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2020, "sourceHeader": 1},
                    {"source": data_2021, "sourceHeader": 1},
                    {"source": data_2022, "sourceHeader": 1},
                    {"source": data_2023, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic + "(次数)"
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))

    elif match == question[6] or match == question[8]:
        year = ["2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        data_2023 = [
            ['地区', "2023"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2022 = [
            ['地区', "2022"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2021 = [
            ['地区', "2021"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "1"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "2"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "1"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2020 = [
            ['地区', "2020"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        data_2019 = [
            ['地区', "2019"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2018 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        data_2017 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        data_2016 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        config_bar = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2016, "sourceHeader": 1},
                    {"source": data_2017, "sourceHeader": 1},
                    {"source": data_2018, "sourceHeader": 1},
                    {"source": data_2019, "sourceHeader": 1},
                    {"source": data_2020, "sourceHeader": 1},
                    {"source": data_2021, "sourceHeader": 1},
                    {"source": data_2022, "sourceHeader": 1},
                    {"source": data_2023, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic + "(次数)"
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "4"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "5"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "6"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "7"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "8"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))

    else:
        year = ["2024", "2025", "2026", "2027", "2028"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        data_2024 = [
            ['地区', "2024"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2025 = [
            ['地区', "2025"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        data_2026 = [
            ['地区', "2026"],
            ['成都市', "0"],
            ['绵阳市', "2"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        data_2027 = [
            ['地区', "2027"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2028 = [
            ['地区', "2028"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        config_bar = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "预测"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2024, "sourceHeader": 1},
                    {"source": data_2025, "sourceHeader": 1},
                    {"source": data_2026, "sourceHeader": 1},
                    {"source": data_2027, "sourceHeader": 1},
                    {"source": data_2028, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic + "(次数)"
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "4"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))


async def response(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                   history=Body([],
                                description="历史对话",
                                examples=[[
                                    {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                    {"role": "assistant", "content": "虎头虎脑"}]]
                                ),
                   stream: bool = Body(False, description="流式输出"), ):
    print(query)
    if not query:
        res = {
            "response": ""
        }
        return ResponseMessage(data=res)
    response = get_completion(query)
    return ResponseMessage(data=response)


async def map_geojson():
    # 你看看你的China.json文件在哪 改一下路径
    if area == "中国":
        if os.path.exists('D:/project/langchain-chatglm/china_internet.json'):
            with open('D:/project/langchain-chatglm/china_internet.json', 'r', encoding='utf-8') as f:
                js = json.load(f)
        else:
            js = {}
        return MapMessage(data=js)
    elif area == "四川省":
        if os.path.exists('Sichuan.json'):
            with open('Sichuan.json', 'r', encoding='utf-8') as f:
                js = json.load(f)
        else:
            js = {}
        return MapMessage(data=js)
    else:
        js = {}
    return MapMessage(data=js)


async def graph_data(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                     history=Body([],
                                  description="历史对话",
                                  examples=[[
                                      {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                      {"role": "assistant", "content": "虎头虎脑"}]]
                                  ),
                     stream: bool = Body(False, description="流式输出")):
    if query != "":
        if os.path.exists("language_graph/" + query):
            file = query.split(".")
            if file[1] == "json":
                with open("language_graph/" + query, encoding='utf-8') as f:
                    graph = eval(f.read())
                    if graph["type"] == "force":
                        categories_data = []
                        for i in range(0, len(graph["categories"])):
                            categories_data.append(graph["categories"][i]["name"])
                        config_graph = {
                            "title": {
                                "text": ' China ',
                                "subtext": 'Default layout',
                                "top": 'top',
                                "left": 'right',
                                "textStyle": {
                                    "fontSize": 40,
                                    "fontWeight": 900,
                                },
                            },
                            "toolbox": {
                                "show": 1,
                                "orient": "vertical",
                                "left": "right",
                                "top": "center",
                                "feature": {
                                    "restore": {},
                                    "saveAsImage": {}
                                }
                            },
                            "tooltip": {},
                            "legend": [{
                                "data": categories_data,
                                "textStyle": {
                                    "fontSize": 16,
                                    "fontWeight": 600,
                                },
                            }],
                            "series": [
                                {
                                    "type": 'graph',
                                    "layout": 'force',
                                    "data": graph["nodes"],
                                    "links": graph["links"],
                                    "categories": graph["categories"],
                                    "roam": "scale",
                                    "symbol": 'circle',
                                    "label": {
                                        "show": 1,
                                        "position": 'right',
                                        "formatter": '{b}',
                                        "color": "black",
                                        "fontSize": 12,
                                        "fontWeight": 900
                                    },
                                    "labelLayout": {
                                        "hideOverlap": 1
                                    },
                                    "scaleLimit": {
                                        "min": 0.4,
                                        "max": 4
                                    },
                                    "lineStyle": {
                                        "color": 'source',
                                        "curveness": 0.3
                                    },
                                    "emphasis": {
                                        "focus": 'adjacency',
                                        "lineStyle": {
                                            "width": 10

                                        }
                                    },
                                    "force": {
                                        "edgeLength": 5,
                                        "repulsion": 20,
                                        "gravity": 0.2
                                    },
                                }
                            ]
                        }
                    else:
                        categories_data = []
                        for i in range(0, len(graph["categories"])):
                            categories_data.append(graph["categories"][i]["name"])
                        config_graph = {
                            "title": {
                                "text": 'Les Miserables',
                                "subtext": 'Default layout',
                                "top": 'top',
                                "left": 'right'
                            },
                            "toolbox": {
                                "show": 1,
                                "orient": "vertical",
                                "left": "right",
                                "top": "center",
                                "feature": {
                                    "restore": {},
                                    "saveAsImage": {}
                                }
                            },
                            "tooltip": {},
                            "legend": [{
                                "data": categories_data
                            }],
                            "animationDuration": 1500,
                            "animationEasingUpdate": 'quinticInOut',
                            "series": [
                                {
                                    "name": 'Les Miserables',
                                    "type": 'graph',
                                    "layout": 'none',
                                    "data": graph["nodes"],
                                    "links": graph["links"],
                                    "categories": graph["categories"],
                                    "roam": "scale",
                                    "symbol": 'circle',
                                    "label": {
                                        "show": 0,
                                        "position": 'right',
                                        "formatter": '{b}',
                                        "color": "black"
                                    },
                                    "labelLayout": {
                                        "hideOverlap": 1
                                    },
                                    "scaleLimit": {
                                        "min": 0.4,
                                        "max": 4
                                    },
                                    "lineStyle": {
                                        "color": 'source',
                                        "curveness": 0.3
                                    },
                                    "emphasis": {
                                        "focus": 'adjacency',
                                        "lineStyle": {
                                            "width": 10

                                        }
                                    }
                                }
                            ]
                        }
                    return ChatMessage(data=str(config_graph))
            elif file[1] == "csv":
                graph = csvTojson.CSVTOJSON("language_graph/" + query, "graph_data.json")
                categories_data = []
                for i in range(0, len(graph["categories"])):
                    categories_data.append(graph["categories"][i]["name"])
                config_graph = {
                    "title": {
                        "text": ' China ',
                        "subtext": 'Default layout',
                        "top": 'top',
                        "left": 'right',
                        "textStyle": {
                            "fontSize": 40,
                            "fontWeight": 900,
                        },
                    },
                    "toolbox": {
                        "show": 1,
                        "orient": "vertical",
                        "left": "right",
                        "top": "center",
                        "feature": {
                            "restore": {},
                            "saveAsImage": {}
                        }
                    },
                    "tooltip": {},
                    "legend": [{
                        "data": categories_data,
                        "textStyle": {
                            "fontSize": 16,
                            "fontWeight": 600,
                        },
                    }],
                    "series": [
                        {
                            "type": 'graph',
                            "layout": 'force',
                            "data": graph["nodes"],
                            "links": graph["links"],
                            "categories": graph["categories"],
                            "roam": "scale",
                            "symbol": 'circle',
                            "label": {
                                "show": 1,
                                "position": 'right',
                                "formatter": '{b}',
                                "color": "black",
                                "fontSize": 12,
                                "fontWeight": 900
                            },
                            "labelLayout": {
                                "hideOverlap": 1
                            },
                            "scaleLimit": {
                                "min": 0.4,
                                "max": 6
                            },
                            "lineStyle": {
                                "color": 'source',
                                "curveness": 0.3
                            },
                            "emphasis": {
                                "focus": 'adjacency',
                                "lineStyle": {
                                    "width": 10
                                }
                            }
                        }
                    ]
                }
            else:
                config_graph = {}
            return ChatMessage(data=str(config_graph))
        else:
            config_graph = {}
        return ChatMessage(data=str(config_graph))
    else:
        config_graph = {}
    return ChatMessage(data=str(config_graph))


async def OP_JSON1(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                  query: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and query:
        if os.path.exists("language_graph/" + input_file):
            info = {"tpl": op_graph_file.Op_json("language_graph/" + input_file, query)}
            return ResponseMessage(data=info)
        else:
            info = {"tpl": ""}
            return ResponseMessage(data=info)
    else:
        info = {"tpl": ""}
    return ResponseMessage(data=info)


async def CSVtoJSON(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                    output_file: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and output_file != "":
        if os.path.exists("language_graph/" + input_file):
            file = input_file.split(".")
            if file[1] == "csv":
                csvTojson.CSVTOJSON("language_graph/" + input_file, output_file)
                alert = {"tpl": "转换完成!"}
            else:
                alert = {"tpl": "请上传csv文件！"}
            return ResponseMessage(data=alert)
        else:
            alert = {"tpl": "文件不存在！"}
        return ResponseMessage(data=alert)
    else:
        alert = {"tpl": ""}
    return ResponseMessage(data=alert)


async def Knowledge_Extraction(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                               output_file: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and output_file != "":
        alert = {"tpl": ""}
        return ResponseMessage(data=alert)
    else:
        alert = {"tpl": "文件不存在!"}
        return ResponseMessage(data=alert)


async def Graph_Update(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                       output_file: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and output_file != "":
        alert = {"tpl": ""}
        return ResponseMessage(data=alert)
    else:
        alert = {"tpl": "文件不存在!"}
        return ResponseMessage(data=alert)


async def sichuan_map_data(years: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                           types: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                           history=Body([],
                                        description="历史对话",
                                        examples=[[
                                            {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                            {"role": "assistant", "content": "虎头虎脑"}]]
                                        ),
                           stream: bool = Body(False, description="流式输出"),
                           ):
    global area
    question = ["2020",
                "2021",
                "2022",
                "2023"]
    # 字符串相似度匹配
    match = difflib.get_close_matches(years, question, n=1, cutoff=0.8)
    if not match:
        config_graph = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_graph))
    match = match[0]
    if types == "地震":
        if match == question[0]:
            year = "2020"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2020 = [
                ['地区', "2020"],
                ['成都市', "3"],
                ['绵阳市', "12"],
                ['自贡市', "8"],
                ['泸州市', "1"],
                ['德阳市', "2"],
                ['广元市', "4"],
                ['遂宁市', "0"],
                ['内江市', "5"],
                ['乐山市', "3"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "1"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "42"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "7"],
                ['甘孜藏族自治州', "13"],
                ['凉山彝族自治州', "3"]
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2020,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[1]:
            year = "2021"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2021 = [
                ['地区', "2021"],
                ['成都市', "1"],
                ['绵阳市', "8"],
                ['自贡市', "4"],
                ['泸州市', "11"],
                ['德阳市', "0"],
                ['广元市', "3"],
                ['遂宁市', "0"],
                ['内江市', "6"],
                ['乐山市', "5"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "2"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "24"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "12"],
                ['甘孜藏族自治州', "4"],
                ['凉山彝族自治州', "13"]
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2021,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[2]:
            year = "2022"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2022 = [
                ['地区', "2022"],
                ['成都市', "1"],
                ['绵阳市', "6"],
                ['自贡市', "0"],
                ['泸州市', "3"],
                ['德阳市', "0"],
                ['广元市', "2"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "4"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "15"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "1"],
                ['宜宾市', "17"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "23"],
                ['甘孜藏族自治州', "22"],
                ['凉山彝族自治州', "2"]
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2022,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[3]:
            year = "2023"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2023 = [
                ['地区', "2023"],
                ['成都市', "1"],
                ['绵阳市', "2"],
                ['自贡市', "1"],
                ['泸州市', "2"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "9"],
                ['乐山市', "1"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "5"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "1"],
                ['宜宾市', "20"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "1"],
                ['甘孜藏族自治州', "24"],
                ['凉山彝族自治州', "2"],
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2023,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
    elif types == "滑坡":
        if match == question[0]:
            year = "2020"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2020 = [
                ['地区', "2020"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "1"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "0"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "0"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "0"],
                ['甘孜藏族自治州', "1"],
                ['凉山彝族自治州', "0"],
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2020,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[1]:
            year = "2021"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2021 = [
                ['地区', "2021"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "1"],
                ['内江市', "0"],
                ['乐山市', "1"],
                ['资阳市', "0"],
                ['南充市', "2"],
                ['达州市', "1"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "1"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "0"],
                ['甘孜藏族自治州', "0"],
                ['凉山彝族自治州', "0"],
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2021,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[2]:
            year = "2022"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2022 = [
                ['地区', "2022"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "0"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "0"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "0"],
                ['甘孜藏族自治州', "0"],
                ['凉山彝族自治州', "0"]
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2022,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[3]:
            year = "2023"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2023 = [
                ['地区', "2023"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "1"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "1"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "0"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "1"],
                ['甘孜藏族自治州', "0"],
                ['凉山彝族自治州', "0"],
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2023,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
    else:
        config_graph = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_graph))


async def OP_JSON2(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                  query: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and query:
        if input_file == "地震":
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                info = {"tpl": op_graph_file.Op_json("language_graph/sichuan_2023dizhen.json", query)}
                return ResponseMessage(data=info)
            else:
                info = {"tpl": ""}
                return ResponseMessage(data=info)
        elif input_file == "滑坡":
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                info = {"tpl": op_graph_file.Op_json("language_graph/sichuan_2023huapo.json", query)}
                return ResponseMessage(data=info)
            else:
                info = {"tpl": ""}
                return ResponseMessage(data=info)
        else:
            info = {"tpl": ""}
            return ResponseMessage(data=info)
    else:
        info = {"tpl": ""}
    return ResponseMessage(data=info)


async def login(name: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                password: str = Body(..., description=123, examples=["恼羞成怒"]),
                code: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if name == "yyh" and password == "123" and code == "4192":
        url = {"tpl": "连接成功!", "url": "http://yyh.system.com/system.html#/home_page"}
    else:
        url = {"tpl": "连接失败!", "url": ""}
    return ResponseMessage(data=url)


async def sichuan_map_geojson():
    # 你看看你的China.json文件在哪 改一下路径
    if os.path.exists('Sichuan.json'):
        with open('Sichuan.json', 'r', encoding='utf-8') as f:
            js = json.load(f)
    else:
        js = {}
    return MapMessage(data=js)


async def Case_Study(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                     history=Body([],
                                  description="历史对话",
                                  examples=[[
                                      {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                      {"role": "assistant", "content": "虎头虎脑"}]]
                                  ),
                     stream: bool = Body(False, description="流式输出")):
    print(query)
    question = "如何实现根据一个docx文件构建图谱"
    if query == question:
        with open("language_graph/case.json", encoding='utf-8') as f:
            case = eval(f.read())
            config_tree = {
                "tooltip": {
                    "trigger": 'item',
                    "triggerOn": 'mousemove'
                },
                "series": [
                    {
                        "type": 'tree',
                        "data": [case],
                        "roam": "scale",
                        "left": '2%',
                        "right": '2%',
                        "top": '8%',
                        "bottom": '20%',
                        "symbol": 'emptyCircle',
                        "orient": 'vertical',
                        "collapsed": 1,
                        "initialTreeDepth": "null",
                        "label": {
                            "position": 'right',
                            "verticalAlign": 'middle',
                            "align": 'left',
                            "fontSize": 15
                        },
                        "leaves": {
                            "label": {
                                "position": 'right',
                                "verticalAlign": 'middle',
                                "align": 'left'
                            }
                        },
                        "animationDurationUpdate": 750
                    }
                ]
            }
    else:
        config_tree = {}
    return ChatMessage(data=str(config_tree))


async def Tem_Draw(input_list: dict = Body(..., description="用户输入")):
    print(input_list)
    data_file_name = input_list["input_list"]['data_file']
    name_file_name = input_list["input_list"]['name_file']
    title_name = input_list["input_list"]['title']
    little_title_name = input_list["input_list"]['little_title']
    tool_name = input_list["input_list"]['tool']
    label_name = input_list["input_list"]['label']
    zoom_name = input_list["input_list"]['zoom']
    zoom_min = input_list["input_list"]['zoom_min']
    zoom_max = input_list["input_list"]['zoom_max']
    bgcolor_name = input_list["input_list"]['bgcolor']
    legend_name = input_list["input_list"]['legend']
    legend_color = legend_name.split(",")
    if tool_name == "true":
        tool_value = 1
    else:
        tool_value = 0
    if label_name == "true":
        label_value = 1
    else:
        label_value = 0
    if zoom_name == "true":
        zoom_name = "scale"
    if data_file_name:
        if os.path.exists("language_graph/" + data_file_name):
            with open("language_graph/" + data_file_name, encoding='utf-8') as f_data:
                data_file = eval(f_data.read())
    else:
        option = {}
        return ChatMessage(data=str(option))
    if name_file_name:
        if os.path.exists("language_graph/" + name_file_name):
            with open("language_graph/" + name_file_name, encoding='utf-8') as f_name:
                name_file = eval(f_name.read())
    else:
        name_file = {}
    option = {
        "backgroundColor": bgcolor_name,
        "title": {
            "text": title_name,
            "subtext": little_title_name
        },
        "tooltip": {
            "trigger": 'item',
            "formatter": '{b}<br/>{c} (p / km2)'
        },
        "toolbox": {
            "show": tool_value,
            "orient": 'vertical',
            "left": 'right',
            "top": 'center',
            "feature": {
                "dataView": {"readOnly": 0},
                "restore": {},
                "saveAsImage": {}
            }
        },
        "visualMap": {
            "min": 800,
            "max": 50000,
            "text": ['High', 'Low'],
            'realtime': 0,
            "calculable": 1,
            "inRange": {
                "color": legend_color
            }
        },
        "dataset": [{"source": data_file, "sourceHeader": 1}],
        "series": [
            {
                "type": "map",
                "name": '香港18区人口密度',
                "map": "HK",
                "roam": zoom_name,
                "datasetIndex": 0,
                "label": {
                    "show": label_value
                },
                "nameMap": name_file,
                "scaleLimit": {
                    "min": zoom_min,
                    "max": zoom_max
                },
            }
        ]
    }
    return ChatMessage(data=str(option))


async def map_geojson_HK():
    if os.path.exists('language_graph/HK.json'):
        with open('language_graph/HK.json', 'r', encoding='utf-8') as f:
            js = json.load(f)
    else:
        js = {}
    return MapMessage(data=js)


if __name__ == '__main__':
    app = FastAPI(
        title="Test Server",
    )
    # 自己看看map_geojson函数里的路径！！！！！！
    app.get("/map_geojson",
            tags=["get"],
            summary="获取geoJson文件")(map_geojson)

    app.post("/bar",
             tags=["post"],
             summary="柱状图的config")(bar_data)

    app.post("/map",
             tags=["post"],
             summary="地图的config")(map_data)

    app.post("/response",
             tags=["post"],
             summary="答复的内容")(response)

    app.post("/graph",
             tags=["post"],
             summary="图谱的config")(graph_data)

    app.post("/graph_json",
             tags=["post"],
             summary="地图的config")(OP_JSON1)

    app.post("/csv_To_json",
             tags=["post"],
             summary="格式文件")(CSVtoJSON)

    app.post("/Kg_extraction",
             tags=["post"],
             summary="知识提取")(Knowledge_Extraction)

    app.post("/graph_update",
             tags=["post"],
             summary="图谱更新")(Graph_Update)

    app.post("/case",
             tags=["post"],
             summary="案例介绍的config")(Case_Study)

    app.get("/sichuan_map_geojson",
            tags=["get"],
            summary="获取geoJson文件")(sichuan_map_geojson)

    app.post("/login",
             tags=["post"],
             summary="获取geoJson文件")(login)

    app.post("/sichuan_map",
             tags=["post"],
             summary="地图的config")(sichuan_map_data)

    app.post("/graph_json",
             tags=["post"],
             summary="地图的config")(OP_JSON2)

    app.get("/HK_geojson",
            tags=["get"],
            summary="获取geoJson文件")(map_geojson_HK)

    app.post("/Tem_Draw",
             tags=["post"],
             summary="地图的config")(Tem_Draw)

    origins = [
        "http://yyh.system.com",
        "http://127.0.0.1",
        "http://localhost",
        "http://yyh.system"
    ]

    app.add_middleware(
        CORSMiddleware,
        allow_origins=origins,
        allow_credentials=True,
        allow_methods=["*"],
        allow_headers=["*"],
    )
    uvicorn.run(app, host="0.0.0.0", port=7861)
