import json
import os
import uvicorn
from language_graph import csvTojson, op_graph_file
from fastapi import FastAPI
from fastapi.middleware.cors import CORSMiddleware
from fastapi import Body
import pydantic
from pydantic import BaseModel
import difflib

area = "四川省"


class BaseResponse(BaseModel):
    status: int = pydantic.Field(0, description="HTTP status code")
    msg: str = pydantic.Field("success", description="HTTP status message")

    class Config:
        orm_mode = True
        schema_extra = {
            "example": {
                "code": 0,
                "msg": "success",
            }
        }


class ChatMessage(BaseResponse):
    data: str = pydantic.Field(..., description="Map config")

    class Config:
        orm_mode = True
        schema_extra = {
            "example": {
                "status": 0,
                "msg": "success",
                "data": {}
            }
        }


class MapMessage(BaseResponse):
    data: dict = pydantic.Field(..., description="Map config")

    class Config:
        schema_extra = {
            "example": {
                "status": 0,
                "msg": "success",
                "data": {}
            }
        }


class ResponseMessage(BaseResponse):
    data: dict = pydantic.Field(..., description="Map config")

    class Config:
        schema_extra = {
            "example": {
                "status": 0,
                # "msg": "success",
                "data": {}
            }
        }


async def map_data(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                   history=Body([],
                                description="历史对话",
                                examples=[[
                                    {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                    {"role": "assistant", "content": "虎头虎脑"}]]
                                ),
                   stream: bool = Body(False, description="流式输出"),
                   ):
    global area
    question = ["根据最新的人口普查，中国的人口数量有多少",
                "中国的庞大人口数量对其社会和经济发展有哪些影响",
                "中国近几十年的人口数量变化趋势是怎样的",
                "针对中国不断增长的人口数量，你能提出一些可持续的人口管理策略吗",
                "未来几年内，你认为中国的人口数量会如何变化，你能预测并描述可能的人口趋势吗",
                "四川省在近年来发生了哪些重大的地震",
                "四川省曾经发生过哪些重大的山体滑坡事件",
                "这些事件造成了什么样的影响，包括对人们的生活、环境和基础设施造成的影响",
                "针对四川省地质灾害，特别是山体滑坡和地震，你能提出一些有效的预防和减轻灾害影响的策略和应对方案吗",
                "未来五年内，四川省可能面临哪些潜在的地质灾害风险，特别是山体滑坡，你能预测这些风险的发生概率和可能的影响吗",
                ]
    # 字符串相似度匹配
    match = difflib.get_close_matches(query, question, n=1, cutoff=0.8)
    if not match:
        config_map = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_map))
    match = match[0]

    # 第一个问题
    # 第二个问题
    if match == question[0] or match == question[1]:
        year = '2021年'  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        data = [['地区', "2020"],
                ['台湾省', "23561236"],
                ['香港特别行政区', "7474200"],
                ['澳门特别行政区', "683218"],
                ['北京市', "21893095"],
                ['天津市', "13866009"],
                ['河北省', "74610235"],
                ['山西省', "34915616"],
                ['内蒙古自治区', "24049155"],
                ['辽宁省', "42591407"],
                ['吉林省', "24073453"],
                ['黑龙江省', "31850088"],
                ['上海市', "24870895"],
                ['江苏省', "84748016"],
                ['浙江省', "64567588"],
                ['安徽省', "61027171"],
                ['福建省', "41540086"],
                ['江西省', "45188635"],
                ['山东省', "101527453"],
                ['河南省', "99365519"],
                ['湖北省', "57752557"],
                ['湖南省', "66444864"],
                ['广东省', "126012510"],
                ['广西壮族自治区', "50126804"],
                ['海南省', "10081232"],
                ['重庆市', "32054159"],
                ['四川省', "83674866"],
                ['贵州省', "38562148"],
                ['云南省', "47209277"],
                ['西藏自治区', "3648100"],
                ['陕西省', "39528999"],
                ['甘肃省', "25019831"],
                ['青海省', "5923957"],
                ['宁夏回族自治区', "7202654"],
                ['新疆维吾尔自治区', "25852345"]
                ]
        config_map = {"title": {"text": year + area + topic},
                      "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                      "toolbox": {
                          "show": 1,
                          "orient": "vertical",
                          "left": "right",
                          "top": "center",
                          "feature": {
                              "restore": {},
                              "saveAsImage": {}
                          }
                      },
                      "dataset": [{"source": data, "sourceHeader": 1}],
                      "visualMap": {"type": "continuous", "min": 500000, "max": 120000000, "text": ["High", "Low"],
                                    # 改
                                    "realtime": 0, "calculable": 1,
                                    "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                      "series": [{"type": "map", "name": year + area + topic, "map": "CHN", "roam": "scale",
                                  "datasetIndex": 0, "label": {"show": 1}}]}
        print(config_map)
        return ChatMessage(data=str(config_map))
    # 第三个问题
    # 第四个问题
    elif match == question[2] or match == question[3]:
        year = ["1964", "1982", "1990", "2000", "2010", "2020"]  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        mapdata_1964 = [['地区', "1964"],
                        ['台湾省', "12041544"],
                        ['香港特别行政区', "3504600"],
                        ['澳门特别行政区', "201400"],
                        ['北京市', "7568495"],
                        ['天津市', "45687781"],
                        ['河北省', "45687781"],
                        ['山西省', "18015067"],
                        ['内蒙古自治区', "12348638"],
                        ['辽宁省', "26946200"],
                        ['吉林省', "15668663"],
                        ['黑龙江省', "20118271"],
                        ['上海市', "10816458"],
                        ['江苏省', "44504608"],
                        ['浙江省', "28318573"],
                        ['安徽省', "31241657"],
                        ['福建省', "16757223"],
                        ['江西省', "21068019"],
                        ['山东省', "55519038"],
                        ['河南省', "50325511"],
                        ['湖北省', "33709344"],
                        ['湖南省', "37182286"],
                        ['广东省', "42800849"],
                        ['广西壮族自治区', "20845017"],
                        ['海南省', "6557482"],
                        ['重庆市', "30900000"],
                        ['四川省', "67956490"],
                        ['贵州省', "17140521"],
                        ['云南省', "20509525"],
                        ['西藏自治区', "1251225"],
                        ['陕西省', "20766915"],
                        ['甘肃省', "12630569"],
                        ['青海省', "2145604"],
                        ['宁夏回族自治区', "2107490"],
                        ['新疆维吾尔自治区', "7270067"],
                        ]
        mapdata_1982 = [
            ['地区', "1982"],
            ['台湾省', "18270749"],
            ['香港特别行政区', "5264500"],
            ['澳门特别行政区', "256700"],
            ['北京市', "9230687"],
            ['天津市', "7764141"],
            ['河北省', "53005876"],
            ['山西省', "25291389"],
            ['内蒙古自治区', "19274279"],
            ['辽宁省', "35721693"],
            ['吉林省', "22560053"],
            ['黑龙江省', "32665546"],
            ['上海市', "11859748"],
            ['江苏省', "60521114"],
            ['浙江省', "38884603"],
            ['安徽省', "49665724"],
            ['福建省', "25931106"],
            ['江西省', "33184827"],
            ['山东省', "74419054"],
            ['河南省', "74422739"],
            ['湖北省', "47804150"],
            ['湖南省', "54008851"],
            ['广东省', "59299220"],
            ['广西壮族自治区', "36420960"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "99713310"],
            ['贵州省', "28552997"],
            ['云南省', "32553817"],
            ['西藏自治区', "1892393"],
            ['陕西省', "28904423"],
            ['甘肃省', "19569261"],
            ['青海省', "3895706"],
            ['宁夏回族自治区', "3895578"],
            ['新疆维吾尔自治区', "13081681"]
        ]
        mapdata_1990 = [
            ['地区', "1990"],
            ['台湾省', "20155830"],
            ['香港特别行政区', "5704500"],
            ['澳门特别行政区', "350200"],
            ['北京市', "10819407"],
            ['天津市', "8785402"],
            ['河北省', "61082439"],
            ['山西省', "28759014"],
            ['内蒙古自治区', "21456798"],
            ['辽宁省', "39459697"],
            ['吉林省', "24658721"],
            ['黑龙江省', "35214873"],
            ['上海市', "13341896"],
            ['江苏省', "67056519"],
            ['浙江省', "41445930"],
            ['安徽省', "56180813"],
            ['福建省', "30097274"],
            ['江西省', "37710281"],
            ['山东省', "84392827"],
            ['河南省', "85509535"],
            ['湖北省', "53969210"],
            ['湖南省', "60659754"],
            ['广东省', "62829236"],
            ['广西壮族自治区', "42245765"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "107218173"],
            ['贵州省', "32391066"],
            ['云南省', "36972610"],
            ['西藏自治区', "2196010"],
            ['陕西省', "32882403"],
            ['甘肃省', "22371141"],
            ['青海省', "4456946"],
            ['宁夏回族自治区', "4655451"],
            ['新疆维吾尔自治区', "15155778"],
        ]
        mapdata_2000 = [
            ['地区', "2000"],
            ['台湾省', "22280000"],
            ['香港特别行政区', "6780000"],
            ['澳门特别行政区', "440000"],
            ['北京市', "13820000"],
            ['天津市', "10010000"],
            ['河北省', "67440000"],
            ['山西省', "32970000"],
            ['内蒙古自治区', "23760000"],
            ['辽宁省', "42380000"],
            ['吉林省', "27280000"],
            ['黑龙江省', "36890000"],
            ['上海市', "16740000"],
            ['江苏省', "74380000"],
            ['浙江省', "46770000"],
            ['安徽省', "59860000"],
            ['福建省', "34710000"],
            ['江西省', "41400000"],
            ['山东省', "90790000"],
            ['河南省', "92560000"],
            ['湖北省', "60280000"],
            ['湖南省', "64400000"],
            ['广东省', "86420000"],
            ['广西壮族自治区', "44890000"],
            ['海南省', "7870000"],
            ['重庆市', "30900000"],
            ['四川省', "83290000"],
            ['贵州省', "35250000"],
            ['云南省', "42880000"],
            ['西藏自治区', "2620000"],
            ['陕西省', "36050000"],
            ['甘肃省', "25620000"],
            ['青海省', "5180000"],
            ['宁夏回族自治区', "5620000"],
            ['新疆维吾尔自治区', "19250000"],
        ]
        mapdata_2010 = [
            ['地区', "2010"],
            ['台湾省', "23162123"],
            ['香港特别行政区', "7097600"],
            ['澳门特别行政区', "552300"],
            ['北京市', "61780000"],
            ['天津市', "22620000"],
            ['河北省', "52430000"],
            ['山西省', "31140000"],
            ['内蒙古自治区', "25220000"],
            ['辽宁省', "52340000"],
            ['吉林省', "27160000"],
            ['黑龙江省', "34740000"],
            ['上海市', "50530000"],
            ['江苏省', "85070000"],
            ['浙江省', "50780000"],
            ['安徽省', "39850000"],
            ['福建省', "30850000"],
            ['江西省', "30520000"],
            ['山东省', "83290000"],
            ['河南省', "60160000"],
            ['湖北省', "54560000"],
            ['湖南省', "49890000"],
            ['广东省', "85670000"],
            ['广西壮族自治区', "27510000"],
            ['海南省', "6740000"],
            ['重庆市', "24930000"],
            ['四川省', "53680000"],
            ['贵州省', "18390000"],
            ['云南省', "26560000"],
            ['西藏自治区', "1650000"],
            ['陕西省', "39400000"],
            ['甘肃省', "19230000"],
            ['青海省', "4850000"],
            ['宁夏回族自治区', "5770000"],
            ['新疆维吾尔自治区', "23200000"],
        ]
        mapdata_2020 = [
            ['地区', "2020"],
            ['台湾省', "23561236"],
            ['香港特别行政区', "7474200"],
            ['澳门特别行政区', "683218"],
            ['北京市', "21893095"],
            ['天津市', "13866009"],
            ['河北省', "74610235"],
            ['山西省', "34915616"],
            ['内蒙古自治区', "24049155"],
            ['辽宁省', "42591407"],
            ['吉林省', "24073453"],
            ['黑龙江省', "31850088"],
            ['上海市', "24870895"],
            ['江苏省', "84748016"],
            ['浙江省', "64567588"],
            ['安徽省', "61027171"],
            ['福建省', "41540086"],
            ['江西省', "45188635"],
            ['山东省', "101527453"],
            ['河南省', "99365519"],
            ['湖北省', "57752557"],
            ['湖南省', "66444864"],
            ['广东省', "126012510"],
            ['广西壮族自治区', "50126804"],
            ['海南省', "10081232"],
            ['重庆市', "32054159"],
            ['四川省', "83674866"],
            ['贵州省', "38562148"],
            ['云南省', "47209277"],
            ['西藏自治区', "3648100"],
            ['陕西省', "39528999"],
            ['甘肃省', "25019831"],
            ['青海省', "5923957"],
            ['宁夏回族自治区', "7202654"],
            ['新疆维吾尔自治区', "25852345"]
        ]
        config_map = {
            "baseOption": {
                "title": {"text": "近几十年来" + area + topic + "变化"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_1964, "sourceHeader": 1},
                    {"source": mapdata_1982, "sourceHeader": 1},
                    {"source": mapdata_1990, "sourceHeader": 1},
                    {"source": mapdata_2000, "sourceHeader": 1},
                    {"source": mapdata_2010, "sourceHeader": 1},
                    {"source": mapdata_2020, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": 500000, "max": 120000000, "text": ["High", "Low"],  # 改
                              "realtime": 0, "calculable": 1,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "3", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "4", "label": {"show": 0}}]
                },
                {
                    "series": [{"type": "map", "name": "近几十年来" + area + topic, "map": "CHN", "roam": "scale",
                                "datasetIndex": "5", "label": {"show": 0}}]
                }
            ]}
        return ChatMessage(data=str(config_map))
    # 第五个问题
    elif match == question[4]:
        year = ["2025", "2030", "2035", "2040"]  # 年份
        topic = '人口数量'  # 主题
        unit = "万人"  # 单位
        area = "中国"  # 地区
        # 地理底图的数据
        mapdata_2025 = [
            ['地区', "2025"],
            ['安徽省', "6102.7"],
            ['北京市', "2189.3"],
            ['福建省', "4154.0"],
            ['甘肃省', "2502.0"],
            ['广东省', "12601.3"],
            ['广西壮族自治区', "5012.7"],
            ['贵州省', "3856.2"],
            ['海南省', "1008.1"],
            ['河北省', "7461.0"],
            ['河南省', "9936.6"],
            ['黑龙江省', "3185.0"],
            ['湖北省', "5775.3"],
            ['湖南省', "6644.5"],
            ['吉林省', "2407.3"],
            ['江苏省', "8474.8"],
            ['江西省', "4518.9"],
            ['辽宁省', "4259.1"],
            ['内蒙古自治区', "2404.9"],
            ['宁夏回族自治区', "720.3"],
            ['青海省', "592.4"],
            ['山东省', "10152.7"],
            ['山西省', "3491.6"],
            ['陕西省', "3952.9"],
            ['上海市', "2487.1"],
            ['四川省', "8367.5"],
            ['天津市', "1386.6"],
            ['西藏自治区', "364.8"],
            ['新疆维吾尔自治区', "2585.2"],
            ['云南省', "4720.9"],
            ['浙江省', "6456.8"],
            ['重庆市', "3205.4"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        mapdata_2030 = [
            ['地区', "2030"],
            ['安徽省', "6140.8"],
            ['北京市', "2179.9"],
            ['福建省', "4278.3"],
            ['甘肃省', "2460"],
            ['广东省', "13015.5"],
            ['广西壮族自治区', "5147"],
            ['贵州省', "3963.7"],
            ['海南省', "1049.2"],
            ['河北省', "7494.5"],
            ['河南省', "9989.9"],
            ['黑龙江省', "3094.6"],
            ['湖北省', "5800.6"],
            ['湖南省', "6622.6"],
            ['吉林省', "2344.4"],
            ['江苏省', "8492.7"],
            ['江西省', "4512.4"],
            ['辽宁省', "4109.8"],
            ['内蒙古自治区', "2351.5"],
            ['宁夏回族自治区', "738"],
            ['青海省', "594.5"],
            ['山东省', "10267"],
            ['山西省', "3453.1"],
            ['陕西省', "3987.9"],
            ['上海市', "2507.5"],
            ['四川省', "8368.6"],
            ['天津市', "1402.3"],
            ['西藏自治区', "387.9"],
            ['新疆维吾尔自治区', "2722.5"],
            ['云南省', "4683.4"],
            ['浙江省', "6761.3"],
            ['重庆市', "3286.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        mapdata_2035 = [
            ['地区', "2035"],
            ['安徽省', "6065.0"],
            ['北京市', "2120.8"],
            ['福建省', "4357.9"],
            ['甘肃省', "2348.6"],
            ['广东省', "13310.8"],
            ['广西壮族自治区', "5228.0"],
            ['贵州省', "4019.0"],
            ['海南省', "1083.9"],
            ['河北省', "7390.4"],
            ['河南省', "9851.8"],
            ['黑龙江省', "2916.7"],
            ['湖北省', "5598.1"],
            ['湖南省', "6464.1"],
            ['吉林省', "2214.4"],
            ['江苏省', "8336.0"],
            ['江西省', "4410.0"],
            ['辽宁省', "3824.6"],
            ['内蒙古自治区', "2226.2"],
            ['宁夏回族自治区', "746.1"],
            ['青海省', "584.0"],
            ['山东省', "10197.3"],
            ['山西省', "3328.0"],
            ['陕西省', "3951.5"],
            ['上海市', "2482.5"],
            ['四川省', "8186.5"],
            ['天津市', "1396.2"],
            ['西藏自治区', "411.7"],
            ['新疆维吾尔自治区', "2858.4"],
            ['云南省', "4529.2"],
            ['浙江省', "7073.4"],
            ['重庆市', "3328.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        mapdata_2040 = [
            ['地区', "2040"],
            ['安徽省', "5977.5"],
            ['北京市', "2064.4"],
            ['福建省', "4401.3"],
            ['甘肃省', "2249.6"],
            ['广东省', "13485.1"],
            ['广西壮族自治区', "5268.6"],
            ['贵州省', "4044.8"],
            ['海南省', "1106.5"],
            ['河北省', "7274.4"],
            ['河南省', "9697.6"],
            ['黑龙江省', "2762.3"],
            ['湖北省', "5412"],
            ['湖南省', "6309"],
            ['吉林省', "2101.2"],
            ['江苏省', "8174"],
            ['江西省', "4308.7"],
            ['辽宁省', "3580.8"],
            ['内蒙古自治区', "2116.6"],
            ['宁夏回族自治区', "749.2"],
            ['青海省', "573"],
            ['山东省', "10095.9"],
            ['山西省', "3213.7"],
            ['陕西省', "3904.7"],
            ['上海市', "2451.4"],
            ['四川省', "8005"],
            ['天津市', "1385"],
            ['西藏自治区', "428.7"],
            ['新疆维吾尔自治区', "2953.3"],
            ['云南省', "4386.4"],
            ['浙江省', "7289.2"],
            ['重庆市', "3346.5"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"]
        ]
        config_map = {
            "baseOption": {
                "title": {"text": "未来十多年" + area + topic + "预测"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2025, "sourceHeader": 1},
                    {"source": mapdata_2030, "sourceHeader": 1},
                    {"source": mapdata_2035, "sourceHeader": 1},
                    {"source": mapdata_2040, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": 50, "max": 10000, "text": ["High", "Low"],
                              "realtime": 0, "calculable": 1,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": "未来十多年" + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))
    elif match == question[5] or match == question[7]:
        year = ["2020", "2021", "2022", "2023"]  # 年份
        topic = '地震'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        mapdata_2023 = [
            ['地区', "2023"],
            ['成都市', "1"],
            ['绵阳市', "2"],
            ['自贡市', "1"],
            ['泸州市', "2"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "9"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "5"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "20"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "24"],
            ['凉山彝族自治州', "2"],
        ]
        mapdata_2022 = [
            ['地区', "2022"],
            ['成都市', "1"],
            ['绵阳市', "6"],
            ['自贡市', "0"],
            ['泸州市', "3"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "4"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "15"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "17"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "23"],
            ['甘孜藏族自治州', "22"],
            ['凉山彝族自治州', "2"]
        ]
        mapdata_2021 = [
            ['地区', "2021"],
            ['成都市', "1"],
            ['绵阳市', "8"],
            ['自贡市', "4"],
            ['泸州市', "11"],
            ['德阳市', "0"],
            ['广元市', "3"],
            ['遂宁市', "0"],
            ['内江市', "6"],
            ['乐山市', "5"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "2"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "24"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "12"],
            ['甘孜藏族自治州', "4"],
            ['凉山彝族自治州', "13"]
        ]
        mapdata_2020 = [
            ['地区', "2020"],
            ['成都市', "3"],
            ['绵阳市', "12"],
            ['自贡市', "8"],
            ['泸州市', "1"],
            ['德阳市', "2"],
            ['广元市', "4"],
            ['遂宁市', "0"],
            ['内江市', "5"],
            ['乐山市', "3"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "42"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "7"],
            ['甘孜藏族自治州', "13"],
            ['凉山彝族自治州', "3"]
        ]

        config_map = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2020, "sourceHeader": 1},
                    {"source": mapdata_2021, "sourceHeader": 1},
                    {"source": mapdata_2022, "sourceHeader": 1},
                    {"source": mapdata_2023, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": '0', "max": '24', "text": ["多", "少"],
                              "realtime": 0, "calculable": 0,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": year[0] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[1] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[2] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[3] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))
    elif match == question[6] or match == question[8]:
        year = ["2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        mapdata_2023 = [
            ['地区', "2023"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2022 = [
            ['地区', "2022"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2021 = [
            ['地区', "2021"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "1"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "2"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "1"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2020 = [
            ['地区', "2020"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2019 = [
            ['地区', "2019"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2018 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2017 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        mapdata_2016 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        config_map = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2016, "sourceHeader": 1},
                    {"source": mapdata_2017, "sourceHeader": 1},
                    {"source": mapdata_2018, "sourceHeader": 1},
                    {"source": mapdata_2019, "sourceHeader": 1},
                    {"source": mapdata_2020, "sourceHeader": 1},
                    {"source": mapdata_2021, "sourceHeader": 1},
                    {"source": mapdata_2022, "sourceHeader": 1},
                    {"source": mapdata_2023, "sourceHeader": 1},
                ],
                "toolbox": {
                    "show": 1,
                    "orient": "vertical",
                    "left": "right",
                    "top": "center",
                    "feature": {
                        "restore": {},
                        "saveAsImage": {}
                    }
                },
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": '0', "max": '3', "text": ["多", "少"],
                              "realtime": 0, "calculable": 0,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": year[0] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[1] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[2] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[3] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[4] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "4", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[5] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "5", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[6] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "6", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[7] + area + topic + "数据", "map": "CHN", "roam": "scale",
                         "datasetIndex": "7", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))
    else:
        year = ["2024", "2025", "2026", "2027", "2028"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 地理底图的数据
        mapdata_2024 = [
            ['地区', "2024"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2025 = [
            ['地区', "2025"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        mapdata_2026 = [
            ['地区', "2026"],
            ['成都市', "0"],
            ['绵阳市', "2"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2027 = [
            ['地区', "2027"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        mapdata_2028 = [
            ['地区', "2028"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        config_map = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "预测"},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": mapdata_2024, "sourceHeader": 1},
                    {"source": mapdata_2025, "sourceHeader": 1},
                    {"source": mapdata_2026, "sourceHeader": 1},
                    {"source": mapdata_2027, "sourceHeader": 1},
                    {"source": mapdata_2028, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{b}<br/>{c}(" + str(unit) + ")"},
                "visualMap": {"min": '0', "max": '3', "text": ["多", "少"],
                              "realtime": 0, "calculable": 0,
                              "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]}},
                "series": []
            },
            "options": [
                {
                    "series": [
                        {"type": "map", "name": year[0] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "0", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[1] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "1", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[2] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "2", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[3] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "3", "label": {"show": 0}}]
                },
                {
                    "series": [
                        {"type": "map", "name": year[4] + area + topic + "预测", "map": "CHN", "roam": "scale",
                         "datasetIndex": "4", "label": {"show": 0}}]
                }

            ]}
        return ChatMessage(data=str(config_map))


async def bar_data(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                   history=Body([],
                                description="历史对话",
                                examples=[[
                                    {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                    {"role": "assistant", "content": "虎头虎脑"}]]
                                ),
                   stream: bool = Body(False, description="流式输出"),
                   ):
    global area
    question = ["根据最新的人口普查，中国的人口数量有多少",
                "中国的庞大人口数量对其社会和经济发展有哪些影响",
                "中国近几十年的人口数量变化趋势是怎样的",
                "针对中国不断增长的人口数量，你能提出一些可持续的人口管理策略吗",
                "未来几年内，你认为中国的人口数量会如何变化，你能预测并描述可能的人口趋势吗",
                "四川省在近年来发生了哪些重大的地震",
                "四川省曾经发生过哪些重大的山体滑坡事件",
                "这些事件造成了什么样的影响，包括对人们的生活、环境和基础设施造成的影响",
                "针对四川省地质灾害，特别是山体滑坡和地震，你能提出一些有效的预防和减轻灾害影响的策略和应对方案吗",
                "未来五年内，四川省可能面临哪些潜在的地质灾害风险，特别是山体滑坡，你能预测这些风险的发生概率和可能的影响吗",
                ]
    # 字符串相似度匹配
    match = difflib.get_close_matches(query, question, n=1, cutoff=0.8)
    if not match:
        config_bar = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_bar))
    match = match[0]
    # 第一个问题
    # 第二个问题
    if match == question[0] or match == question[1]:
        year = '2021年'  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        data = [['地区', "2020"],
                ['台湾省', "23561236"],
                ['香港特别行政区', "7474200"],
                ['澳门特别行政区', "683218"],
                ['北京市', "21893095"],
                ['天津市', "13866009"],
                ['河北省', "74610235"],
                ['山西省', "34915616"],
                ['内蒙古自治区', "24049155"],
                ['辽宁省', "42591407"],
                ['吉林省', "24073453"],
                ['黑龙江省', "31850088"],
                ['上海市', "24870895"],
                ['江苏省', "84748016"],
                ['浙江省', "64567588"],
                ['安徽省', "61027171"],
                ['福建省', "41540086"],
                ['江西省', "45188635"],
                ['山东省', "101527453"],
                ['河南省', "99365519"],
                ['湖北省', "57752557"],
                ['湖南省', "66444864"],
                ['广东省', "126012510"],
                ['广西壮族自治区', "50126804"],
                ['海南省', "10081232"],
                ['重庆市', "32054159"],
                ['四川省', "83674866"],
                ['贵州省', "38562148"],
                ['云南省', "47209277"],
                ['西藏自治区', "3648100"],
                ['陕西省', "39528999"],
                ['甘肃省', "25019831"],
                ['青海省', "5923957"],
                ['宁夏回族自治区', "7202654"],
                ['新疆维吾尔自治区', "25852345"]
                ]
        config_bar = {"title": {"text": year + area + topic}, "legend": {"formatter": topic},
                      "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                      "dataset": [{"source": data, "sourceHeader": 1}],
                      "xAxis": {"type": "category", "axisTick": {"show": 0}},
                      "yAxis": {"type": 'value', "name": topic}, "series": [{"type": "bar", "datasetIndex": "0"},
                                                                            {"type": "line", "datasetIndex": "0"}]}
        print(config_bar)
        return ChatMessage(data=str(config_bar))
    # 第三个问题
    # 第四个问题
    elif match == question[2] or match == question[3]:
        year = ["1964", "1982", "1990", "2000", "2010", "2020"]  # 年份
        topic = '人口数量'  # 主题
        unit = "人"  # 单位
        area = "中国"  # 地区
        # 数据
        data_1964 = [['地区', "1964"],
                     ['台湾省', "12041544"],
                     ['香港特别行政区', "3504600"],
                     ['澳门特别行政区', "201400"],
                     ['北京市', "7568495"],
                     ['天津市', "45687781"],
                     ['河北省', "45687781"],
                     ['山西省', "18015067"],
                     ['内蒙古自治区', "12348638"],
                     ['辽宁省', "26946200"],
                     ['吉林省', "15668663"],
                     ['黑龙江省', "20118271"],
                     ['上海市', "10816458"],
                     ['江苏省', "44504608"],
                     ['浙江省', "28318573"],
                     ['安徽省', "31241657"],
                     ['福建省', "16757223"],
                     ['江西省', "21068019"],
                     ['山东省', "55519038"],
                     ['河南省', "50325511"],
                     ['湖北省', "33709344"],
                     ['湖南省', "37182286"],
                     ['广东省', "42800849"],
                     ['广西壮族自治区', "20845017"],
                     ['海南省', "6557482"],
                     ['重庆市', "30900000"],
                     ['四川省', "67956490"],
                     ['贵州省', "17140521"],
                     ['云南省', "20509525"],
                     ['西藏自治区', "1251225"],
                     ['陕西省', "20766915"],
                     ['甘肃省', "12630569"],
                     ['青海省', "2145604"],
                     ['宁夏回族自治区', "2107490"],
                     ['新疆维吾尔自治区', "7270067"],
                     ]
        data_1982 = [
            ['地区', "1982"],
            ['台湾省', "18270749"],
            ['香港特别行政区', "5264500"],
            ['澳门特别行政区', "256700"],
            ['北京市', "9230687"],
            ['天津市', "7764141"],
            ['河北省', "53005876"],
            ['山西省', "25291389"],
            ['内蒙古自治区', "19274279"],
            ['辽宁省', "35721693"],
            ['吉林省', "22560053"],
            ['黑龙江省', "32665546"],
            ['上海市', "11859748"],
            ['江苏省', "60521114"],
            ['浙江省', "38884603"],
            ['安徽省', "49665724"],
            ['福建省', "25931106"],
            ['江西省', "33184827"],
            ['山东省', "74419054"],
            ['河南省', "74422739"],
            ['湖北省', "47804150"],
            ['湖南省', "54008851"],
            ['广东省', "59299220"],
            ['广西壮族自治区', "36420960"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "99713310"],
            ['贵州省', "28552997"],
            ['云南省', "32553817"],
            ['西藏自治区', "1892393"],
            ['陕西省', "28904423"],
            ['甘肃省', "19569261"],
            ['青海省', "3895706"],
            ['宁夏回族自治区', "3895578"],
            ['新疆维吾尔自治区', "13081681"]
        ]
        data_1990 = [
            ['地区', "1990"],
            ['台湾省', "20155830"],
            ['香港特别行政区', "5704500"],
            ['澳门特别行政区', "350200"],
            ['北京市', "10819407"],
            ['天津市', "8785402"],
            ['河北省', "61082439"],
            ['山西省', "28759014"],
            ['内蒙古自治区', "21456798"],
            ['辽宁省', "39459697"],
            ['吉林省', "24658721"],
            ['黑龙江省', "35214873"],
            ['上海市', "13341896"],
            ['江苏省', "67056519"],
            ['浙江省', "41445930"],
            ['安徽省', "56180813"],
            ['福建省', "30097274"],
            ['江西省', "37710281"],
            ['山东省', "84392827"],
            ['河南省', "85509535"],
            ['湖北省', "53969210"],
            ['湖南省', "60659754"],
            ['广东省', "62829236"],
            ['广西壮族自治区', "42245765"],
            ['海南省', "6557482"],
            ['重庆市', "30900000"],
            ['四川省', "107218173"],
            ['贵州省', "32391066"],
            ['云南省', "36972610"],
            ['西藏自治区', "2196010"],
            ['陕西省', "32882403"],
            ['甘肃省', "22371141"],
            ['青海省', "4456946"],
            ['宁夏回族自治区', "4655451"],
            ['新疆维吾尔自治区', "15155778"],
        ]
        data_2000 = [
            ['地区', "2000"],
            ['台湾省', "22280000"],
            ['香港特别行政区', "6780000"],
            ['澳门特别行政区', "440000"],
            ['北京市', "13820000"],
            ['天津市', "10010000"],
            ['河北省', "67440000"],
            ['山西省', "32970000"],
            ['内蒙古自治区', "23760000"],
            ['辽宁省', "42380000"],
            ['吉林省', "27280000"],
            ['黑龙江省', "36890000"],
            ['上海市', "16740000"],
            ['江苏省', "74380000"],
            ['浙江省', "46770000"],
            ['安徽省', "59860000"],
            ['福建省', "34710000"],
            ['江西省', "41400000"],
            ['山东省', "90790000"],
            ['河南省', "92560000"],
            ['湖北省', "60280000"],
            ['湖南省', "64400000"],
            ['广东省', "86420000"],
            ['广西壮族自治区', "44890000"],
            ['海南省', "7870000"],
            ['重庆市', "30900000"],
            ['四川省', "83290000"],
            ['贵州省', "35250000"],
            ['云南省', "42880000"],
            ['西藏自治区', "2620000"],
            ['陕西省', "36050000"],
            ['甘肃省', "25620000"],
            ['青海省', "5180000"],
            ['宁夏回族自治区', "5620000"],
            ['新疆维吾尔自治区', "19250000"],
        ]
        data_2010 = [
            ['地区', "2010"],
            ['台湾省', "23162123"],
            ['香港特别行政区', "7097600"],
            ['澳门特别行政区', "552300"],
            ['北京市', "61780000"],
            ['天津市', "22620000"],
            ['河北省', "52430000"],
            ['山西省', "31140000"],
            ['内蒙古自治区', "25220000"],
            ['辽宁省', "52340000"],
            ['吉林省', "27160000"],
            ['黑龙江省', "34740000"],
            ['上海市', "50530000"],
            ['江苏省', "85070000"],
            ['浙江省', "50780000"],
            ['安徽省', "39850000"],
            ['福建省', "30850000"],
            ['江西省', "30520000"],
            ['山东省', "83290000"],
            ['河南省', "60160000"],
            ['湖北省', "54560000"],
            ['湖南省', "49890000"],
            ['广东省', "85670000"],
            ['广西壮族自治区', "27510000"],
            ['海南省', "6740000"],
            ['重庆市', "24930000"],
            ['四川省', "53680000"],
            ['贵州省', "18390000"],
            ['云南省', "26560000"],
            ['西藏自治区', "1650000"],
            ['陕西省', "39400000"],
            ['甘肃省', "19230000"],
            ['青海省', "4850000"],
            ['宁夏回族自治区', "5770000"],
            ['新疆维吾尔自治区', "23200000"],
        ]
        data_2020 = [
            ['地区', "2020"],
            ['台湾省', "23561236"],
            ['香港特别行政区', "7474200"],
            ['澳门特别行政区', "683218"],
            ['北京市', "21893095"],
            ['天津市', "13866009"],
            ['河北省', "74610235"],
            ['山西省', "34915616"],
            ['内蒙古自治区', "24049155"],
            ['辽宁省', "42591407"],
            ['吉林省', "24073453"],
            ['黑龙江省', "31850088"],
            ['上海市', "24870895"],
            ['江苏省', "84748016"],
            ['浙江省', "64567588"],
            ['安徽省', "61027171"],
            ['福建省', "41540086"],
            ['江西省', "45188635"],
            ['山东省', "101527453"],
            ['河南省', "99365519"],
            ['湖北省', "57752557"],
            ['湖南省', "66444864"],
            ['广东省', "126012510"],
            ['广西壮族自治区', "50126804"],
            ['海南省', "10081232"],
            ['重庆市', "32054159"],
            ['四川省', "83674866"],
            ['贵州省', "38562148"],
            ['云南省', "47209277"],
            ['西藏自治区', "3648100"],
            ['陕西省', "39528999"],
            ['甘肃省', "25019831"],
            ['青海省', "5923957"],
            ['宁夏回族自治区', "7202654"],
            ['新疆维吾尔自治区', "25852345"]
        ]
        config_bar = {
            "baseOption": {
                "title": {"text": "近几十年来" + area + topic + "变化"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_1964, "sourceHeader": 1},
                    {"source": data_1982, "sourceHeader": 1},
                    {"source": data_1990, "sourceHeader": 1},
                    {"source": data_2000, "sourceHeader": 1},
                    {"source": data_2010, "sourceHeader": 1},
                    {"source": data_2020, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}, {"type": "line", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}, {"type": "line", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}, {"type": "line", "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}, {"type": "line", "datasetIndex": "3"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "4"}, {"type": "line", "datasetIndex": "4"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "5"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))
    # 第五个问题
    elif match == question[4]:
        year = ["2025", "2030", "2035", "2040"]  # 年份
        topic = '人口数量'  # 主题
        unit = "万人"  # 单位
        area = "中国"  # 地区
        # 地理底图的数据
        data_2025 = [
            ['地区', "2025"],
            ['安徽省', "6102.7"],
            ['北京市', "2189.3"],
            ['福建省', "4154.0"],
            ['甘肃省', "2502.0"],
            ['广东省', "12601.3"],
            ['广西壮族自治区', "5012.7"],
            ['贵州省', "3856.2"],
            ['海南省', "1008.1"],
            ['河北省', "7461.0"],
            ['河南省', "9936.6"],
            ['黑龙江省', "3185.0"],
            ['湖北省', "5775.3"],
            ['湖南省', "6644.5"],
            ['吉林省', "2407.3"],
            ['江苏省', "8474.8"],
            ['江西省', "4518.9"],
            ['辽宁省', "4259.1"],
            ['内蒙古自治区', "2404.9"],
            ['宁夏回族自治区', "720.3"],
            ['青海省', "592.4"],
            ['山东省', "10152.7"],
            ['山西省', "3491.6"],
            ['陕西省', "3952.9"],
            ['上海市', "2487.1"],
            ['四川省', "8367.5"],
            ['天津市', "1386.6"],
            ['西藏自治区', "364.8"],
            ['新疆维吾尔自治区', "2585.2"],
            ['云南省', "4720.9"],
            ['浙江省', "6456.8"],
            ['重庆市', "3205.4"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        data_2030 = [
            ['地区', "2030"],
            ['安徽省', "6140.8"],
            ['北京市', "2179.9"],
            ['福建省', "4278.3"],
            ['甘肃省', "2460"],
            ['广东省', "13015.5"],
            ['广西壮族自治区', "5147"],
            ['贵州省', "3963.7"],
            ['海南省', "1049.2"],
            ['河北省', "7494.5"],
            ['河南省', "9989.9"],
            ['黑龙江省', "3094.6"],
            ['湖北省', "5800.6"],
            ['湖南省', "6622.6"],
            ['吉林省', "2344.4"],
            ['江苏省', "8492.7"],
            ['江西省', "4512.4"],
            ['辽宁省', "4109.8"],
            ['内蒙古自治区', "2351.5"],
            ['宁夏回族自治区', "738"],
            ['青海省', "594.5"],
            ['山东省', "10267"],
            ['山西省', "3453.1"],
            ['陕西省', "3987.9"],
            ['上海市', "2507.5"],
            ['四川省', "8368.6"],
            ['天津市', "1402.3"],
            ['西藏自治区', "387.9"],
            ['新疆维吾尔自治区', "2722.5"],
            ['云南省', "4683.4"],
            ['浙江省', "6761.3"],
            ['重庆市', "3286.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        data_2035 = [
            ['地区', "2035"],
            ['安徽省', "6065.0"],
            ['北京市', "2120.8"],
            ['福建省', "4357.9"],
            ['甘肃省', "2348.6"],
            ['广东省', "13310.8"],
            ['广西壮族自治区', "5228.0"],
            ['贵州省', "4019.0"],
            ['海南省', "1083.9"],
            ['河北省', "7390.4"],
            ['河南省', "9851.8"],
            ['黑龙江省', "2916.7"],
            ['湖北省', "5598.1"],
            ['湖南省', "6464.1"],
            ['吉林省', "2214.4"],
            ['江苏省', "8336.0"],
            ['江西省', "4410.0"],
            ['辽宁省', "3824.6"],
            ['内蒙古自治区', "2226.2"],
            ['宁夏回族自治区', "746.1"],
            ['青海省', "584.0"],
            ['山东省', "10197.3"],
            ['山西省', "3328.0"],
            ['陕西省', "3951.5"],
            ['上海市', "2482.5"],
            ['四川省', "8186.5"],
            ['天津市', "1396.2"],
            ['西藏自治区', "411.7"],
            ['新疆维吾尔自治区', "2858.4"],
            ['云南省', "4529.2"],
            ['浙江省', "7073.4"],
            ['重庆市', "3328.1"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"],
        ]
        data_2040 = [
            ['地区', "2040"],
            ['安徽省', "5977.5"],
            ['北京市', "2064.4"],
            ['福建省', "4401.3"],
            ['甘肃省', "2249.6"],
            ['广东省', "13485.1"],
            ['广西壮族自治区', "5268.6"],
            ['贵州省', "4044.8"],
            ['海南省', "1106.5"],
            ['河北省', "7274.4"],
            ['河南省', "9697.6"],
            ['黑龙江省', "2762.3"],
            ['湖北省', "5412"],
            ['湖南省', "6309"],
            ['吉林省', "2101.2"],
            ['江苏省', "8174"],
            ['江西省', "4308.7"],
            ['辽宁省', "3580.8"],
            ['内蒙古自治区', "2116.6"],
            ['宁夏回族自治区', "749.2"],
            ['青海省', "573"],
            ['山东省', "10095.9"],
            ['山西省', "3213.7"],
            ['陕西省', "3904.7"],
            ['上海市', "2451.4"],
            ['四川省', "8005"],
            ['天津市', "1385"],
            ['西藏自治区', "428.7"],
            ['新疆维吾尔自治区', "2953.3"],
            ['云南省', "4386.4"],
            ['浙江省', "7289.2"],
            ['重庆市', "3346.5"],
            ['澳门特别行政区', "68.3"],
            ['台湾省', "2356.1"],
            ['香港特别行政区', "747.4"]
        ]
        config_bar = {
            "baseOption": {
                "title": {"text": "未来十多年" + area + topic + "预测"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2025, "sourceHeader": 1},
                    {"source": data_2030, "sourceHeader": 1},
                    {"source": data_2035, "sourceHeader": 1},
                    {"source": data_2040, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}, {"type": "line", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}, {"type": "line", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}, {"type": "line", "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}, {"type": "line", "datasetIndex": "3"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))

    elif match == question[5] or match == question[7]:
        year = ["2020", "2021", "2022", "2023"]  # 年份
        topic = '地震'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        data_2023 = [
            ['地区', "2023"],
            ['成都市', "1"],
            ['绵阳市', "2"],
            ['自贡市', "1"],
            ['泸州市', "2"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "9"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "5"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "20"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "24"],
            ['凉山彝族自治州', "2"],
        ]
        data_2022 = [
            ['地区', "2022"],
            ['成都市', "1"],
            ['绵阳市', "6"],
            ['自贡市', "0"],
            ['泸州市', "3"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "4"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "15"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "17"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "23"],
            ['甘孜藏族自治州', "22"],
            ['凉山彝族自治州', "2"]
        ]
        data_2021 = [
            ['地区', "2021"],
            ['成都市', "1"],
            ['绵阳市', "8"],
            ['自贡市', "4"],
            ['泸州市', "11"],
            ['德阳市', "0"],
            ['广元市', "3"],
            ['遂宁市', "0"],
            ['内江市', "6"],
            ['乐山市', "5"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "2"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "24"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "12"],
            ['甘孜藏族自治州', "4"],
            ['凉山彝族自治州', "13"]
        ]
        data_2020 = [
            ['地区', "2020"],
            ['成都市', "3"],
            ['绵阳市', "12"],
            ['自贡市', "8"],
            ['泸州市', "1"],
            ['德阳市', "2"],
            ['广元市', "4"],
            ['遂宁市', "0"],
            ['内江市', "5"],
            ['乐山市', "3"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "42"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "7"],
            ['甘孜藏族自治州', "13"],
            ['凉山彝族自治州', "3"]
        ]

        config_bar = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2020, "sourceHeader": 1},
                    {"source": data_2021, "sourceHeader": 1},
                    {"source": data_2022, "sourceHeader": 1},
                    {"source": data_2023, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic + "(次数)"
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))

    elif match == question[6] or match == question[8]:
        year = ["2016", "2017", "2018", "2019", "2020", "2021", "2022", "2023"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        data_2023 = [
            ['地区', "2023"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "1"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2022 = [
            ['地区', "2022"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2021 = [
            ['地区', "2021"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "1"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "2"],
            ['达州市', "1"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "1"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2020 = [
            ['地区', "2020"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        data_2019 = [
            ['地区', "2019"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2018 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        data_2017 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        data_2016 = [
            ['地区', "2018"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        config_bar = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "历年数据"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2016, "sourceHeader": 1},
                    {"source": data_2017, "sourceHeader": 1},
                    {"source": data_2018, "sourceHeader": 1},
                    {"source": data_2019, "sourceHeader": 1},
                    {"source": data_2020, "sourceHeader": 1},
                    {"source": data_2021, "sourceHeader": 1},
                    {"source": data_2022, "sourceHeader": 1},
                    {"source": data_2023, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic + "(次数)"
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "4"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "5"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "6"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "7"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "8"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))

    else:
        year = ["2024", "2025", "2026", "2027", "2028"]  # 年份
        topic = '山体滑坡'  # 主题
        unit = "次"  # 单位
        area = "四川省"  # 地区
        # 数据
        data_2024 = [
            ['地区', "2024"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "1"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "1"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "1"],
            ['宜宾市', "0"],
            ['攀枝花市', "1"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2025 = [
            ['地区', "2025"],
            ['成都市', "0"],
            ['绵阳市', "1"],
            ['自贡市', "0"],
            ['泸州市', "1"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "0"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "2"],
        ]
        data_2026 = [
            ['地区', "2026"],
            ['成都市', "0"],
            ['绵阳市', "2"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "2"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "1"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "3"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "2"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        data_2027 = [
            ['地区', "2027"],
            ['成都市', "1"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "0"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "1"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "0"],
            ['凉山彝族自治州', "0"],
        ]
        data_2028 = [
            ['地区', "2028"],
            ['成都市', "0"],
            ['绵阳市', "0"],
            ['自贡市', "0"],
            ['泸州市', "0"],
            ['德阳市', "1"],
            ['广元市', "0"],
            ['遂宁市', "0"],
            ['内江市', "0"],
            ['乐山市', "2"],
            ['资阳市', "0"],
            ['南充市', "0"],
            ['达州市', "0"],
            ['雅安市', "0"],
            ['广安市', "0"],
            ['巴中市', "0"],
            ['眉山市', "0"],
            ['宜宾市', "0"],
            ['攀枝花市', "0"],
            ['阿坝藏族羌族自治州', "0"],
            ['甘孜藏族自治州', "1"],
            ['凉山彝族自治州', "0"],
        ]
        config_bar = {
            "baseOption": {
                "backgroundColor": 'transparent',
                "title": {"text": area + topic + "预测"},
                "legend": {"formatter": topic},
                "timeline": {
                    "axisType": 'category',
                    "autoPlay": 1,
                    "data": year
                },
                "dataset": [
                    {"source": data_2024, "sourceHeader": 1},
                    {"source": data_2025, "sourceHeader": 1},
                    {"source": data_2026, "sourceHeader": 1},
                    {"source": data_2027, "sourceHeader": 1},
                    {"source": data_2028, "sourceHeader": 1},
                ],
                "tooltip": {"trigger": "item", "formatter": "{c}(" + str(unit) + ")"},
                "xAxis": {
                    "type": 'category',
                },
                "yAxis": [
                    {
                        "type": 'value',
                        "name": topic + "(次数)"
                    }
                ],
                "series": []
            },
            "options": [
                {
                    "series": [{"type": "bar", "datasetIndex": "0"}]
                },
                {
                    "series": [{"type": "bar", "datasetIndex": "1"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "2"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "3"}]
                },
                {
                    "series": [{"type": 'bar', "datasetIndex": "4"}]
                }
            ]}
        return ChatMessage(data=str(config_bar))


async def response(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                   history=Body([],
                                description="历史对话",
                                examples=[[
                                    {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                    {"role": "assistant", "content": "虎头虎脑"}]]
                                ),
                   stream: bool = Body(False, description="流式输出"), ):
    question = ["根据最新的人口普查，中国的人口数量有多少",
                "中国的庞大人口数量对其社会和经济发展有哪些影响",
                "中国近几十年的人口数量变化趋势是怎样的",
                "针对中国不断增长的人口数量，你能提出一些可持续的人口管理策略吗",
                "未来几年内，你认为中国的人口数量会如何变化，你能预测并描述可能的人口趋势吗",
                "四川省在近年来发生了哪些重大的地震",
                "四川省曾经发生过哪些重大的山体滑坡事件",
                "这些事件造成了什么样的影响，包括对人们的生活、环境和基础设施造成的影响",
                "针对四川省地质灾害，特别是山体滑坡和地震，你能提出一些有效的预防和减轻灾害影响的策略和应对方案吗",
                "未来五年内，四川省可能面临哪些潜在的地质灾害风险，特别是山体滑坡，你能预测这些风险的发生概率和可能的影响吗"
                ]
    print(query)
    if not query:
        res = {
            "response": ""
        }
        return ResponseMessage(data=res)
    # 字符串相似度匹配
    match = difflib.get_close_matches(query, question, n=1, cutoff=0.8)
    if not match:
        res = {
            "response": '该问题暂未收录！'
        }
        return ResponseMessage(data=res)
    match = match[0]
    print(match)
    # 第一个问题
    if match == question[0]:
        res = {
            'response': "   根据国家统计局、国务院第七次全国人口普查领导小组办公室2021年5月11日发布，第七次全国人口普查结果:\n"
                        "  2020年11月1日零时中国人口的基本情况公布如下：中国总人口为1443497378人，其中，普查登记的大陆31个省、自治区、"
                        "直辖市和现役军人的人口共1411778724人。"
        }
        return ResponseMessage(data=res)
    elif match == question[1]:
        res = {
            "response":
                "中国的庞大人口数量对其社会和经济发展产生了广泛而深远的影响。以下是一些主要的影响因素:\n"
                "  1.人口红利：当年龄结构合适时，人口红利可以带来经济的增长，它可以推动技术创新、增加生产效率和降低生产成本。"
                "人口与经济密切相关，对于中国来说人口问题尤为重要。中国近四十年来经济持续增长，其中一个被广泛接受的核心因素是改革开放使得人口红利转化为生产力，"
                "劳动年龄人口不断增长，劳动力供给充足，资本回报率和全要素生产率提高。\n  2.巨大的市场潜力：我国庞大的人口规模意味着潜在的庞大市场需求，"
                "这为国内和国际市场带来了广阔的发展空间和巨大的商业机会。\n  3.劳动力充裕：人口多意味着更多的劳动力，这对国家的经济发展是有利的。我国人口数量庞大，"
                "其中大部分年龄结构较为年轻，这意味着大量的劳动力可以被用于推动经济发展。\n  4.压力巨大：巨大的人口数量也意味着政府和社会将面临各种各样的压力，"
                "例如教育、医疗、就业等问题，在资源不足的情况下人口增长必然会给经济增长带来巨大的压力，教育投入的增长赶不上人口增长的速度，从而导致技术发展受到很大限制，"
                "这些都需要政府和社会付出更多的努力和资源来解决。\n  5.资源有限：我国的人口数量虽然巨大，但其资源却是有限的。大量的人口需要大量的食物、水、能源和土地等资源，"
                "这会给资源的合理使用与保护带来挑战。\n  6.环境压力：人口多意味着环境的压力也会增加，例如空气污染、水污染和垃圾处理等问题，这些都需要政府和社会付出更多的努力和资源来解决。"
                "中国巨大人口数量带来了巨大的市场潜力和劳动力，但同时也带来了压力、资源有限和环境问题等一系列挑战，如何有效应对这些挑战是关系到中国未来发展的重要问题。"
                "\n\n  总体而言，中国的庞大人口既是一个机遇，也是一个挑战。它为中国提供了巨大的劳动力和市场，推动了经济发展，但也需要应对老龄化、资源管理和社会服务等方面的挑战。"
                "中国政府需要继续制定政策来最大程度地利用人口红利，同时解决与人口规模相关的问题。"
        }
        return ResponseMessage(data=res)
    elif match == question[2]:
        res = {
            "response":
                "根据国家统计局发布每年发布的国民经济统计公报：\n"
                "  1964年突破7亿人口，1969年就突破8亿人口，1974年突破9亿人口，1981年突破史无前例的10亿人口，1988年突破11亿人口，"
                "1995年突破12亿人口，2005年突破13亿人口，2017年突破14亿人口，2022年则停留在14.1175亿人口。\n"
                "  80年代以前的中国，每五年就增长一个亿，而随着人口基数的增大，80到90年代增长一个亿的时间拉长到7年，新千年后则需要10年以上，"
                "而2017年以后人口就定格在14亿人口出头，2022年新出生人口73年来首次下降到1000万以下，仅仅为956万，"
                "而死亡人口则是自1991年以来的新高，达到1041万，最终人口减少85万人。"
        }
        return ResponseMessage(data=res)
    elif match == question[3]:
        res = {
            "response":
                "针对中国不断增长的人口数量，我可以从以下方面给出建议供参考：\n"
                "  1.制定长远控制目标，执行计划生育政策。可持续发展要求一个国家的长远人口控制目标应与该国的自然资源环境相称。"
                "中国的土地资源约占世界上土地资源的7%,可耕地资源也约占世界7%,淡水资源仅占5%,矿产资源约占9%。"
                "根据这些主要资源的占有份额,可以大体说中国自然资源总拥有量约为世界自然资源的7%。"
                "因此中国人口控制的长远目标应该是把中国人口数量控制在世界总人口的7%左右。通过计划生育政策，控制人口增长速度，减缓人口压力，保障资源的可持续利用。"
                "\n  2.提高教育水平。提高教育水平可以增强人口的科学文化素质，提高人口的自我保护能力，减少对资源的浪费和破坏。"
                "\n  3.加强健康保障。加强健康保障可以提高人口的生活质量和健康水平，减少疾病对资源的消耗和污染。"
                "\n  4.促进就业和创业。促进就业和创业可以提高人口的生活水平，减少贫困和社会不稳定因素的影响，推动经济的可持续发展。"
                "中国第三产业发展水平还很低。我们应顺应世界经济发展的规律,大力发展第三产业,加速人口城镇化进程,创造更多的就业机会和岗位,"
                "吸纳农村剩余劳动力和城市待岗人员(包括下岗职工),缓解劳动力就业压力。"
                "\n  5.加强社会保障。加强社会保障可以提高人口的生活保障水平，减少社会不公和贫富差距，增强社会的稳定性和可持续性。加快建设和完善城乡社会保障体系。"
                "建立统一的企业职工基本养老保险制度,普遍推行农村社会养老保险制度和合作医疗制度。做好救灾扶贫工作,建立农村最低生活保障制度，兴办各种公益事业。"
                "\n  6.加强环境保护和资源利用。加强环境保护和资源利用可以减少资源的浪费和破坏，保护生态环境，从而实现可持续发展。"
                "\n\n  总之，实施可持续发展在人口方面需要采取多种措施，包括推广计划生育政策、提高教育水平、加强健康保障、促进就业和创业、"
                "加强社会保障、加强环境保护和资源利用等，从而实现人口的可持续发展。"
        }
        return ResponseMessage(data=res)
    elif match == question[4]:
        res = {
            "response": "从以下各个方面分析，预测的未来几年内中国的人口变化趋势，该预测结果仅供参考！\n"
                        "  1.人口总量还在继续增长。2021年末，全国人口14.13亿人。其中，出生人口1062万人，死亡人口首次达到千万级，人口净增长48万，自然增长率是0.34‰。"
                        "\n  2.劳动年龄人口基本稳定。2021年末，16-59岁的劳动年龄人口8.82亿人，占总人口的62.5%；60岁及以上人口2.67亿人，"
                        "占总人口的18.9%，65岁及以上人口2亿人，占总人口14.2%。"
                        "\n  3.城镇人口增加较多。2021年末，城镇常住人口达到9.14亿人，比上年末增加1200多万人；乡村常住人口仍有将近5亿人。"
                        "常住人口的城镇化率为64.72%，比上年末提高0.83个百分点。"
                        "\n  4.流动人口明显增加。2021年末，全国人户分离人口是5.04亿人，比上年末增加1153万人，其中流动人口3.85亿人，增加885万人。"
                        "\n  5.育龄女性总量还是较多的。我国人口基数大，目前仍有3亿多育龄妇女，每年能保持1000多万人的出生规模，人口总量将保持一定水平的增长。"
                        "\n  6.三孩政策效果将逐步显现。从过去十几年看，“单独二孩”“全面二孩”等生育政策均取得积极成效，出生人口数量增加。"
                        "据第七次全国人口普查数据显示，0-14岁少儿人口比2010年多了3000多万人，比重上升了1.35个百分点，"
                        "这主要是两次二孩生育政策促进了生育率提升。出生人口中，二孩占比由2013年的30%左右上升到2021年的43%左右。"
                        "2021年5月，中央政治局会议提出，进一步优化生育政策，实施一对夫妇可以生育三个子女政策及配套支持措施，各地纷纷制定出台了具体实施方案，政策效果将逐步显现。"
                        "\n  7.人口的预期寿命在持续提高。我国医疗卫生条件大幅改善，人民生活水平不断提高，预期寿命不断延长，死亡人口一直少于出生人口，"
                        "有助于人口总量保持增长态势。一些被推迟的生育将在未来一段时间持续释放，这些因素都将对人口总量保持基本稳定发挥积极作用。"
                        "\n\n  总之，在未来一段时期我国人口总量将保持在14亿人以上"
        }
        return ResponseMessage(data=res)
    elif match == question[5]:
        res = {
            'response': "数据来源：\n    四川省地震局官网,统计时间为2020年1月1日至今，统计数据为地震等级为3级（含）及以上等级。"
        }
        return ResponseMessage(data=res)
    elif match == question[6]:
        res = {
            "response":
                "数据来源：\n    四川省自然资源厅官网,数据为四川省自然资源厅官方报道的滑坡事件，统计时间为2016年1月1日至今。"
        }
        return ResponseMessage(data=res)
    elif match == question[7]:
        res = {
            "response":
                "四川省地震，山体滑坡等地质灾害频发对人们的生活，环境和基础设施造成的影响有：\n"
                "   （一）对人们的生活的影响:\n"
                "    1.伤亡：历史上的几次大地震，如2008年的汶川大地震，导致了大量的伤亡。这种灾害给受影响的家庭带来了巨大的心理和情感创伤。\n"
                "    2.流离失所：地震和滑坡经常导致房屋倒塌，许多人因此失去了住所。\n"
                "    3.经济损失：农田、牲畜和其他财产的损失给当地居民带来了经济困难。\n"
                "   （二）对环境的影响:\n"
                "    1.地形改变：强烈的地震和滑坡可能导致地形发生显著变化，如河流改道、山体高度降低等。\n"
                "    2.水源污染：滑坡可能将泥土、岩石和其他物质带入河流，影响饮用水的质量。\n"
                "    3.堰塞湖形成：滑坡或地震导致的山体落入河流中可能会形成堰塞湖，这可能导致上游水位上升、下游水源减少，并有可能发生二次灾害如堰塞湖决堤。\n"
                "   （三）.对基础设施的影响:\n"
                "    1.交通中断：滑坡和地震可能导致道路、桥梁损坏或阻塞，从而切断交通。\n"
                "    2.通信受阻：通信设备如电话线、基站可能在地震或滑坡中受损，导致通信中断。\n"
                "    3.设施损坏：公共设施如学校、医院、水电站等可能遭受损坏，影响正常的服务和运营。\n"
                "   （四）对社会经济的影响:\n"
                "    1.重建成本：灾后重建涉及巨大的资金投入。\n"
                "    2.经济增长受阻：四川省是中国的重要农业和工业区，这些灾害可能对其经济增长产生短期和长期的影响。"
        }
        return ResponseMessage(data=res)
    elif match == question[8]:
        res = {
            "response":
                "   四川由于其独特的地理和地质条件，地震和山体滑坡是该省需要密切关注的地质灾害。以下是一些建议的预防和应对策略：\n"
                "   1.早期预警系统：\n"
                "   （1）地震预警：尽管无法预测地震，但可以通过在地震活跃地区部署地震早期预警系统，在地震发生后的几秒或几分钟内为受影响地区发出警报，从而为人们提供撤离时间。\n"
                "   （2）滑坡预警：使用地质雷达、土壤湿度传感器和其他技术，对滑坡高风险地区进行监测，及时预测和警报。\n"
                "   2.土地规划和建筑设计：\n"
                "   （1）限制或禁止在已知的滑坡和地震高风险地区进行开发。\n"
                "   （2）采用地震安全的建筑设计，如混凝土梁和框架、加固墙体、以及地基隔震系统。\n"
                "   3.加强公众教育和培训：\n"
                "   （1）对学校、企业和社区进行地震和滑坡的应急演练和培训。\n"
                "   （2）提高公众对地震和滑坡的知识和意识，包括如何在发生灾害时保护自己。\n"
                "   4.加强地质调查与研究：\n"
                "   （1）定期进行地质勘查，识别新的滑坡和地震风险地区。\n"
                "   （2）利用科学研究和新技术，如卫星遥感和无人机，来监测和评估潜在的风险。\n"
                "   5.建立应急响应和救援机制：\n"
                "   （1）配备和培训专业的救援团队，确保他们能迅速到达受灾地区。\n"
                "   （2）建立仓储中心，储备必要的救援物资，如帐篷、食品和医疗用品。\n"
                "   6.建立重建和恢复策略：\n"
                "   （1）在灾害后，迅速评估受损的基础设施和建筑，确定修复和重建的优先级。\n"
                "   （2）采取措施避免未来的灾害，如搬迁受损社区，或采取更加坚固的建筑设计。\n"
                "   7.生态恢复与保护：\n"
                "   （1）在滑坡高风险地区进行植被恢复，以减少土壤侵蚀。\n"
                "   （2）避免过度开发或破坏原有的生态系统，尤其是山区的森林和植被。\n"
                "   8.建立与邻近地区和国家的合作机制：\n"
                "   （1）分享数据、研究和最佳实践，共同努力减少地震和滑坡的风险。"
        }
        return ResponseMessage(data=res)
    else:
        res = {
            "response": '该预测结果仅供参考！'
        }
        return ResponseMessage(data=res)


async def map_geojson():
    # 你看看你的China.json文件在哪 改一下路径
    if area == "中国":
        if os.path.exists('D:/project/langchain-chatglm/china_internet.json'):
            with open('D:/project/langchain-chatglm/china_internet.json', 'r', encoding='utf-8') as f:
                js = json.load(f)
        else:
            js = {}
        return MapMessage(data=js)
    elif area == "四川省":
        if os.path.exists('Sichuan.json'):
            with open('Sichuan.json', 'r', encoding='utf-8') as f:
                js = json.load(f)
        else:
            js = {}
        return MapMessage(data=js)
    else:
        js = {}
    return MapMessage(data=js)


async def graph_data(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                     history=Body([],
                                  description="历史对话",
                                  examples=[[
                                      {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                      {"role": "assistant", "content": "虎头虎脑"}]]
                                  ),
                     stream: bool = Body(False, description="流式输出")):
    if query != "":
        if os.path.exists("language_graph/" + query):
            file = query.split(".")
            if file[1] == "json":
                with open("language_graph/" + query, encoding='utf-8') as f:
                    graph = eval(f.read())
                    if graph["type"] == "force":
                        categories_data = []
                        for i in range(0, len(graph["categories"])):
                            categories_data.append(graph["categories"][i]["name"])
                        config_graph = {
                            "title": {
                                "text": ' China ',
                                "subtext": 'Default layout',
                                "top": 'top',
                                "left": 'right',
                                "textStyle": {
                                    "fontSize": 40,
                                    "fontWeight": 900,
                                },
                            },
                            "toolbox": {
                                "show": 1,
                                "orient": "vertical",
                                "left": "right",
                                "top": "center",
                                "feature": {
                                    "restore": {},
                                    "saveAsImage": {}
                                }
                            },
                            "tooltip": {},
                            "legend": [{
                                "data": categories_data,
                                "textStyle": {
                                    "fontSize": 16,
                                    "fontWeight": 600,
                                },
                            }],
                            "series": [
                                {
                                    "type": 'graph',
                                    "layout": 'force',
                                    "data": graph["nodes"],
                                    "links": graph["links"],
                                    "categories": graph["categories"],
                                    "roam": "scale",
                                    "symbol": 'circle',
                                    "label": {
                                        "show": 1,
                                        "position": 'right',
                                        "formatter": '{b}',
                                        "color": "black",
                                        "fontSize": 12,
                                        "fontWeight": 900
                                    },
                                    "labelLayout": {
                                        "hideOverlap": 1
                                    },
                                    "scaleLimit": {
                                        "min": 0.4,
                                        "max": 4
                                    },
                                    "lineStyle": {
                                        "color": 'source',
                                        "curveness": 0.3
                                    },
                                    "emphasis": {
                                        "focus": 'adjacency',
                                        "lineStyle": {
                                            "width": 10

                                        }
                                    },
                                    "force": {
                                        "edgeLength": 5,
                                        "repulsion": 20,
                                        "gravity": 0.2
                                    },
                                }
                            ]
                        }
                    else:
                        categories_data = []
                        for i in range(0, len(graph["categories"])):
                            categories_data.append(graph["categories"][i]["name"])
                        config_graph = {
                            "title": {
                                "text": 'Les Miserables',
                                "subtext": 'Default layout',
                                "top": 'top',
                                "left": 'right'
                            },
                            "toolbox": {
                                "show": 1,
                                "orient": "vertical",
                                "left": "right",
                                "top": "center",
                                "feature": {
                                    "restore": {},
                                    "saveAsImage": {}
                                }
                            },
                            "tooltip": {},
                            "legend": [{
                                "data": categories_data
                            }],
                            "animationDuration": 1500,
                            "animationEasingUpdate": 'quinticInOut',
                            "series": [
                                {
                                    "name": 'Les Miserables',
                                    "type": 'graph',
                                    "layout": 'none',
                                    "data": graph["nodes"],
                                    "links": graph["links"],
                                    "categories": graph["categories"],
                                    "roam": "scale",
                                    "symbol": 'circle',
                                    "label": {
                                        "show": 0,
                                        "position": 'right',
                                        "formatter": '{b}',
                                        "color": "black"
                                    },
                                    "labelLayout": {
                                        "hideOverlap": 1
                                    },
                                    "scaleLimit": {
                                        "min": 0.4,
                                        "max": 4
                                    },
                                    "lineStyle": {
                                        "color": 'source',
                                        "curveness": 0.3
                                    },
                                    "emphasis": {
                                        "focus": 'adjacency',
                                        "lineStyle": {
                                            "width": 10

                                        }
                                    }
                                }
                            ]
                        }
                    return ChatMessage(data=str(config_graph))
            elif file[1] == "csv":
                graph = csvTojson.CSVTOJSON("language_graph/" + query, "graph_data.json")
                categories_data = []
                for i in range(0, len(graph["categories"])):
                    categories_data.append(graph["categories"][i]["name"])
                config_graph = {
                    "title": {
                        "text": ' China ',
                        "subtext": 'Default layout',
                        "top": 'top',
                        "left": 'right',
                        "textStyle": {
                            "fontSize": 40,
                            "fontWeight": 900,
                        },
                    },
                    "toolbox": {
                        "show": 1,
                        "orient": "vertical",
                        "left": "right",
                        "top": "center",
                        "feature": {
                            "restore": {},
                            "saveAsImage": {}
                        }
                    },
                    "tooltip": {},
                    "legend": [{
                        "data": categories_data,
                        "textStyle": {
                            "fontSize": 16,
                            "fontWeight": 600,
                        },
                    }],
                    "series": [
                        {
                            "type": 'graph',
                            "layout": 'force',
                            "data": graph["nodes"],
                            "links": graph["links"],
                            "categories": graph["categories"],
                            "roam": "scale",
                            "symbol": 'circle',
                            "label": {
                                "show": 1,
                                "position": 'right',
                                "formatter": '{b}',
                                "color": "black",
                                "fontSize": 12,
                                "fontWeight": 900
                            },
                            "labelLayout": {
                                "hideOverlap": 1
                            },
                            "scaleLimit": {
                                "min": 0.4,
                                "max": 6
                            },
                            "lineStyle": {
                                "color": 'source',
                                "curveness": 0.3
                            },
                            "emphasis": {
                                "focus": 'adjacency',
                                "lineStyle": {
                                    "width": 10
                                }
                            }
                        }
                    ]
                }
            else:
                config_graph = {}
            return ChatMessage(data=str(config_graph))
        else:
            config_graph = {}
        return ChatMessage(data=str(config_graph))
    else:
        config_graph = {}
    return ChatMessage(data=str(config_graph))


async def OP_JSON1(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                  query: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and query:
        if os.path.exists("language_graph/" + input_file):
            info = {"tpl": op_graph_file.Op_json("language_graph/" + input_file, query)}
            return ResponseMessage(data=info)
        else:
            info = {"tpl": ""}
            return ResponseMessage(data=info)
    else:
        info = {"tpl": ""}
    return ResponseMessage(data=info)


async def CSVtoJSON(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                    output_file: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and output_file != "":
        if os.path.exists("language_graph/" + input_file):
            file = input_file.split(".")
            if file[1] == "csv":
                csvTojson.CSVTOJSON("language_graph/" + input_file, output_file)
                alert = {"tpl": "转换完成!"}
            else:
                alert = {"tpl": "请上传csv文件！"}
            return ResponseMessage(data=alert)
        else:
            alert = {"tpl": "文件不存在！"}
        return ResponseMessage(data=alert)
    else:
        alert = {"tpl": ""}
    return ResponseMessage(data=alert)


async def Knowledge_Extraction(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                               output_file: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and output_file != "":
        alert = {"tpl": ""}
        return ResponseMessage(data=alert)
    else:
        alert = {"tpl": "文件不存在!"}
        return ResponseMessage(data=alert)


async def Graph_Update(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                       output_file: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and output_file != "":
        alert = {"tpl": ""}
        return ResponseMessage(data=alert)
    else:
        alert = {"tpl": "文件不存在!"}
        return ResponseMessage(data=alert)


async def sichuan_map_data(years: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                           types: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                           history=Body([],
                                        description="历史对话",
                                        examples=[[
                                            {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                            {"role": "assistant", "content": "虎头虎脑"}]]
                                        ),
                           stream: bool = Body(False, description="流式输出"),
                           ):
    global area
    question = ["2020",
                "2021",
                "2022",
                "2023"]
    # 字符串相似度匹配
    match = difflib.get_close_matches(years, question, n=1, cutoff=0.8)
    if not match:
        config_graph = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_graph))
    match = match[0]
    if types == "地震":
        if match == question[0]:
            year = "2020"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2020 = [
                ['地区', "2020"],
                ['成都市', "3"],
                ['绵阳市', "12"],
                ['自贡市', "8"],
                ['泸州市', "1"],
                ['德阳市', "2"],
                ['广元市', "4"],
                ['遂宁市', "0"],
                ['内江市', "5"],
                ['乐山市', "3"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "1"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "42"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "7"],
                ['甘孜藏族自治州', "13"],
                ['凉山彝族自治州', "3"]
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2020,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[1]:
            year = "2021"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2021 = [
                ['地区', "2021"],
                ['成都市', "1"],
                ['绵阳市', "8"],
                ['自贡市', "4"],
                ['泸州市', "11"],
                ['德阳市', "0"],
                ['广元市', "3"],
                ['遂宁市', "0"],
                ['内江市', "6"],
                ['乐山市', "5"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "2"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "24"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "12"],
                ['甘孜藏族自治州', "4"],
                ['凉山彝族自治州', "13"]
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2021,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[2]:
            year = "2022"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2022 = [
                ['地区', "2022"],
                ['成都市', "1"],
                ['绵阳市', "6"],
                ['自贡市', "0"],
                ['泸州市', "3"],
                ['德阳市', "0"],
                ['广元市', "2"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "4"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "15"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "1"],
                ['宜宾市', "17"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "23"],
                ['甘孜藏族自治州', "22"],
                ['凉山彝族自治州', "2"]
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2022,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[3]:
            year = "2023"  # 年份
            topic = '地震'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2023 = [
                ['地区', "2023"],
                ['成都市', "1"],
                ['绵阳市', "2"],
                ['自贡市', "1"],
                ['泸州市', "2"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "9"],
                ['乐山市', "1"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "5"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "1"],
                ['宜宾市', "20"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "1"],
                ['甘孜藏族自治州', "24"],
                ['凉山彝族自治州', "2"],
            ]
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                with open("language_graph/sichuan_2023dizhen.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2023,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
    elif types == "滑坡":
        if match == question[0]:
            year = "2020"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2020 = [
                ['地区', "2020"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "1"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "0"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "0"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "0"],
                ['甘孜藏族自治州', "1"],
                ['凉山彝族自治州', "0"],
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2020,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[1]:
            year = "2021"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2021 = [
                ['地区', "2021"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "1"],
                ['内江市', "0"],
                ['乐山市', "1"],
                ['资阳市', "0"],
                ['南充市', "2"],
                ['达州市', "1"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "1"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "0"],
                ['甘孜藏族自治州', "0"],
                ['凉山彝族自治州', "0"],
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2021,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[2]:
            year = "2022"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2022 = [
                ['地区', "2022"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "0"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "0"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "0"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "0"],
                ['甘孜藏族自治州', "0"],
                ['凉山彝族自治州', "0"]
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2022,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
        elif match == question[3]:
            year = "2023"  # 年份
            topic = '山体滑坡'  # 主题
            unit = "次"  # 单位
            area = "四川省"  # 地区
            # 数据
            mapdata_2023 = [
                ['地区', "2023"],
                ['成都市', "0"],
                ['绵阳市', "0"],
                ['自贡市', "0"],
                ['泸州市', "0"],
                ['德阳市', "0"],
                ['广元市', "0"],
                ['遂宁市', "0"],
                ['内江市', "0"],
                ['乐山市', "1"],
                ['资阳市', "0"],
                ['南充市', "0"],
                ['达州市', "1"],
                ['雅安市', "0"],
                ['广安市', "0"],
                ['巴中市', "0"],
                ['眉山市', "0"],
                ['宜宾市', "0"],
                ['攀枝花市', "0"],
                ['阿坝藏族羌族自治州', "1"],
                ['甘孜藏族自治州', "0"],
                ['凉山彝族自治州', "0"],
            ]
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                with open("language_graph/sichuan_2023huapo.json", encoding='utf-8') as f:
                    graph = eval(f.read())
                    categories_data = [graph["categories"][0]["name"]]
                    config_graph = {
                        "backgroundColor": 'transparent',
                        "title": {
                            "text": year + "年" + area + topic + "数据",
                            "subtext": 'Natural disaster situation',
                            "sublink": 'https://www.mem.gov.cn/xw/yjglbgzdt/202307/t20230707_455762.shtml',
                            "top": 'top',
                            "left": 'left'
                        },
                        "dataset": {
                            "source": mapdata_2023,
                        },
                        "visualMap": {
                            "type": "continuous", "min": 0, "max": 30, "text": ["高", "低"], "top": "center",
                            "inRange": {"color": ["mistyrose", "indianred", "orangered", "red"]},
                            "seriesIndex": 0
                        },
                        "toolbox": {
                            "show": 1,
                            "left": "left",
                            "top": "35%",
                            "feature": {
                                "restore": {}
                            }
                        },
                        "legend": [{
                            "data": categories_data
                        }],
                        "tooltip": {},
                        "animationDuration": 1500,
                        "animationEasingUpdate": 'quinticInOut',
                        "series": [
                            {
                                "type": "map",
                                "datasetIndex": 0,
                                "zoom": 1.1,
                                "name": year + area + topic + "数据",
                                "map": "Sichuan",
                                "roam": "scale",
                                "zlevel": 1,
                                "label": {"show": 0, "color": "transparent"},
                                "tooltip": {"trigger": "item", "valueFormatter": "{b}<br/>{c}(" + unit + ")",
                                            "formatter": "{b}<br/>{c}(" + unit + ")"},
                                "itemStyle": {
                                    "areaColor": '#fac858'
                                },
                                "showLegendSymbol": 0,
                                "emphasis": {
                                    "label": {
                                        "show": 0,
                                        "position": "inside"
                                    }
                                },
                                "select": {
                                    "label": {
                                        "show": 1
                                    }
                                },
                                # "silent": 1
                            },
                            {
                                "name": '四川省',
                                "zlevel": 100,
                                "type": 'graph',
                                # "visualMap": 0,
                                "layout": 'none',
                                "data": graph["nodes"],
                                "links": graph["links"],
                                "categories": graph["categories"],
                                "center": [103.265735, 31.259462],
                                "zoom": 0.68,
                                "roam": "scale",
                                "symbol": 'circle',
                                "label": {
                                    "show": 1,
                                    "position": 'inside',
                                    "formatter": '{b}',
                                    "color": "black"
                                },
                                "labelLayout": {
                                    "hideOverlap": 1
                                },
                                "scaleLimit": {
                                    "min": 0.4,
                                    "max": 4
                                },
                                "lineStyle": {
                                    "width": 5,
                                    "color": 'source',
                                    "curveness": 0.3
                                },
                                "emphasis": {
                                    "focus": 'adjacency',
                                    "lineStyle": {
                                        "width": 10
                                    }
                                }
                            }
                        ]
                    }
            return ChatMessage(data=str(config_graph))
    else:
        config_graph = {"backgroundColor": 'transparent'}
        return ChatMessage(data=str(config_graph))


async def OP_JSON2(input_file: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                  query: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if input_file and query:
        if input_file == "地震":
            if os.path.exists("language_graph/sichuan_2023dizhen.json"):
                info = {"tpl": op_graph_file.Op_json("language_graph/sichuan_2023dizhen.json", query)}
                return ResponseMessage(data=info)
            else:
                info = {"tpl": ""}
                return ResponseMessage(data=info)
        elif input_file == "滑坡":
            if os.path.exists("language_graph/sichuan_2023huapo.json"):
                info = {"tpl": op_graph_file.Op_json("language_graph/sichuan_2023huapo.json", query)}
                return ResponseMessage(data=info)
            else:
                info = {"tpl": ""}
                return ResponseMessage(data=info)
        else:
            info = {"tpl": ""}
            return ResponseMessage(data=info)
    else:
        info = {"tpl": ""}
    return ResponseMessage(data=info)


async def login(name: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                password: str = Body(..., description=123, examples=["恼羞成怒"]),
                code: str = Body(..., description="用户输入", examples=["恼羞成怒"])):
    if name == "yyh" and password == "123" and code == "4192":
        url = {"tpl": "连接成功!", "url": "http://yyh.system.com/system.html#/home_page"}
    else:
        url = {"tpl": "连接失败!", "url": ""}
    return ResponseMessage(data=url)


async def sichuan_map_geojson():
    # 你看看你的China.json文件在哪 改一下路径
    if os.path.exists('Sichuan.json'):
        with open('Sichuan.json', 'r', encoding='utf-8') as f:
            js = json.load(f)
    else:
        js = {}
    return MapMessage(data=js)


async def Case_Study(query: str = Body(..., description="用户输入", examples=["恼羞成怒"]),
                     history=Body([],
                                  description="历史对话",
                                  examples=[[
                                      {"role": "user", "content": "我们来玩成语接龙，我先来，生龙活虎"},
                                      {"role": "assistant", "content": "虎头虎脑"}]]
                                  ),
                     stream: bool = Body(False, description="流式输出")):
    print(query)
    question = "如何实现根据一个docx文件构建图谱"
    if query == question:
        with open("language_graph/case.json", encoding='utf-8') as f:
            case = eval(f.read())
            config_tree = {
                "tooltip": {
                    "trigger": 'item',
                    "triggerOn": 'mousemove'
                },
                "series": [
                    {
                        "type": 'tree',
                        "data": [case],
                        "roam": "scale",
                        "left": '2%',
                        "right": '2%',
                        "top": '8%',
                        "bottom": '20%',
                        "symbol": 'emptyCircle',
                        "orient": 'vertical',
                        "collapsed": 1,
                        "initialTreeDepth": "null",
                        "label": {
                            "position": 'right',
                            "verticalAlign": 'middle',
                            "align": 'left',
                            "fontSize": 15
                        },
                        "leaves": {
                            "label": {
                                "position": 'right',
                                "verticalAlign": 'middle',
                                "align": 'left'
                            }
                        },
                        "animationDurationUpdate": 750
                    }
                ]
            }
    else:
        config_tree = {}
    return ChatMessage(data=str(config_tree))


async def Tem_Draw(input_list: dict = Body(..., description="用户输入")):
    print(input_list)
    data_file_name = input_list["input_list"]['data_file']
    name_file_name = input_list["input_list"]['name_file']
    title_name = input_list["input_list"]['title']
    little_title_name = input_list["input_list"]['little_title']
    tool_name = input_list["input_list"]['tool']
    label_name = input_list["input_list"]['label']
    zoom_name = input_list["input_list"]['zoom']
    zoom_min = input_list["input_list"]['zoom_min']
    zoom_max = input_list["input_list"]['zoom_max']
    bgcolor_name = input_list["input_list"]['bgcolor']
    legend_name = input_list["input_list"]['legend']
    legend_color = legend_name.split(",")
    if tool_name == "true":
        tool_value = 1
    else:
        tool_value = 0
    if label_name == "true":
        label_value = 1
    else:
        label_value = 0
    if zoom_name == "true":
        zoom_name = "scale"
    if data_file_name:
        if os.path.exists("language_graph/" + data_file_name):
            with open("language_graph/" + data_file_name, encoding='utf-8') as f_data:
                data_file = eval(f_data.read())
    else:
        option = {}
        return ChatMessage(data=str(option))
    if name_file_name:
        if os.path.exists("language_graph/" + name_file_name):
            with open("language_graph/" + name_file_name, encoding='utf-8') as f_name:
                name_file = eval(f_name.read())
    else:
        name_file = {}
    option = {
        "backgroundColor": bgcolor_name,
        "title": {
            "text": title_name,
            "subtext": little_title_name
        },
        "tooltip": {
            "trigger": 'item',
            "formatter": '{b}<br/>{c} (p / km2)'
        },
        "toolbox": {
            "show": tool_value,
            "orient": 'vertical',
            "left": 'right',
            "top": 'center',
            "feature": {
                "dataView": {"readOnly": 0},
                "restore": {},
                "saveAsImage": {}
            }
        },
        "visualMap": {
            "min": 800,
            "max": 50000,
            "text": ['High', 'Low'],
            'realtime': 0,
            "calculable": 1,
            "inRange": {
                "color": legend_color
            }
        },
        "dataset": [{"source": data_file, "sourceHeader": 1}],
        "series": [
            {
                "type": "map",
                "name": '香港18区人口密度',
                "map": "HK",
                "roam": zoom_name,
                "datasetIndex": 0,
                "label": {
                    "show": label_value
                },
                "nameMap": name_file,
                "scaleLimit": {
                    "min": zoom_min,
                    "max": zoom_max
                },
            }
        ]
    }
    return ChatMessage(data=str(option))


async def map_geojson_HK():
    if os.path.exists('language_graph/HK.json'):
        with open('language_graph/HK.json', 'r', encoding='utf-8') as f:
            js = json.load(f)
    else:
        js = {}
    return MapMessage(data=js)


if __name__ == '__main__':
    app = FastAPI(
        title="Test Server",
    )
    # 自己看看map_geojson函数里的路径！！！！！！
    app.get("/map_geojson",
            tags=["get"],
            summary="获取geoJson文件")(map_geojson)

    app.post("/bar",
             tags=["post"],
             summary="柱状图的config")(bar_data)

    app.post("/map",
             tags=["post"],
             summary="地图的config")(map_data)

    app.post("/response",
             tags=["post"],
             summary="答复的内容")(response)

    app.post("/graph",
             tags=["post"],
             summary="图谱的config")(graph_data)

    app.post("/graph_json",
             tags=["post"],
             summary="地图的config")(OP_JSON1)

    app.post("/csv_To_json",
             tags=["post"],
             summary="格式文件")(CSVtoJSON)

    app.post("/Kg_extraction",
             tags=["post"],
             summary="知识提取")(Knowledge_Extraction)

    app.post("/graph_update",
             tags=["post"],
             summary="图谱更新")(Graph_Update)

    app.post("/case",
             tags=["post"],
             summary="案例介绍的config")(Case_Study)

    app.get("/sichuan_map_geojson",
            tags=["get"],
            summary="获取geoJson文件")(sichuan_map_geojson)

    app.post("/login",
             tags=["post"],
             summary="获取geoJson文件")(login)

    app.post("/sichuan_map",
             tags=["post"],
             summary="地图的config")(sichuan_map_data)

    app.post("/graph_json",
             tags=["post"],
             summary="地图的config")(OP_JSON2)

    app.get("/HK_geojson",
            tags=["get"],
            summary="获取geoJson文件")(map_geojson_HK)

    app.post("/Tem_Draw",
             tags=["post"],
             summary="地图的config")(Tem_Draw)

    origins = [
        "http://yyh.system.com",
        "http://127.0.0.1",
        "http://localhost",
        "http://yyh.system"
    ]

    app.add_middleware(
        CORSMiddleware,
        allow_origins=origins,
        allow_credentials=True,
        allow_methods=["*"],
        allow_headers=["*"],
    )
    uvicorn.run(app, host="0.0.0.0", port=7861)
